
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimGraphRuntime
/// dependency: ControlRig
/// dependency: CoreUObject
/// dependency: DP1Project
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C
/// Size: 0x0D98 (3480 bytes) (0x000D40 - 0x000D98) align 16 MaxSize: 0x0D98
class ABP_EventCharaActorBody_C : public AEventCharaActorBody
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0D40   (0x0008)  
	class UStaticMeshComponent*                        LookTarget;                                                 // 0x0D48   (0x0008)  
	class USkeletalMeshComponent*                      LHandWeapon;                                                // 0x0D50   (0x0008)  
	class USkeletalMeshComponent*                      RHandWeapon;                                                // 0x0D58   (0x0008)  
	class UAnimSequenceBase*                           DefaultBodyAnim;                                            // 0x0D60   (0x0008)  
	class AActor*                                      lookAtTarget;                                               // 0x0D68   (0x0008)  
	bool                                               LookAtEnable;                                               // 0x0D70   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0D71   (0x0007)  MISSED
	SDK_UNDEFINED(16,684) /* TScriptInterface<BlueprintGeneratedClass> */ __um(LookAtHolder);                      // 0x0D78   (0x0010)  
	bool                                               LookAtHolderInitialized;                                    // 0x0D88   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0D89   (0x0007)  MISSED
	double                                             LookAtSeconds;                                              // 0x0D90   (0x0008)  


	/// Functions
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.]KbPn
	// void __Kb___Pn();                                                                                                        // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.SKbPn
	// void _SKb___Pn();                                                                                                        // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2fd44f0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.0000
	// void _0_0_0_0_(FName _partsName);                                                                                        // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.000n0h
	// void _0_0_0n0h(FName _partsName, bool _visible);                                                                         // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.EditorTick
	// void EditorTick();                                                                                                       // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.CustomTick
	// void CustomTick();                                                                                                       // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/BP_EventCharaActorBody.BP_EventCharaActorBody_C.ExecuteUbergraph_BP_EventCharaActorBody
	// void ExecuteUbergraph_BP_EventCharaActorBody(int32_t EntryPoint);                                                        // [0x2fd44f0] Final|HasDefaults    
};

/// Class /Game/Evt/_blueprints/Chara/BP_ase0030_megamisou.BP_ase0030_megamisou_C
/// Size: 0x0D98 (3480 bytes) (0x000D98 - 0x000D98) align 16 MaxSize: 0x0D98
class ABP_ase0030_megamisou_C : public ABP_EventCharaActorBody_C
{ 
public:
};

/// Class /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C
/// Size: 0x2A60 (10848 bytes) (0x000898 - 0x002A60) align 16 MaxSize: 0x2A60
class Umdl_ase0030_megamisou_AnimBP_C : public UCharaAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0898   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x08A0   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[168]; // 0x08A8   (0x00A8)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0950   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0958   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0960   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x0980   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator;                      // 0x0A48   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator0;                     // 0x0AF0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult;                       // 0x0B98   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0BB8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend1;                                 // 0x0BE0   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator2;                     // 0x0CA8   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator3;                     // 0x0D50   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult4;                      // 0x0DF8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0E18   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend6;                                 // 0x0E40   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator7;                     // 0x0F08   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator8;                     // 0x0FB0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult9;                      // 0x1058   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x1078   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x10A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x10C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x10F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x1118   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x1140   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x1168   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1190   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x11D8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x11F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult18;                                // 0x1240   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer19;                             // 0x1260   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult20;                                // 0x12A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer21;                             // 0x12C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult22;                                // 0x1310   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1330   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend23;                                // 0x13F8   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator24;                    // 0x14C0   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator25;                    // 0x1568   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult26;                     // 0x1610   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x1630   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend28;                                // 0x1658   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator29;                    // 0x1720   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator30;                    // 0x17C8   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult31;                     // 0x1870   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x1890   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend33;                                // 0x18B8   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator34;                    // 0x1980   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator35;                    // 0x1A28   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult36;                     // 0x1AD0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult37;                           // 0x1AF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult38;                           // 0x1B18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult39;                           // 0x1B40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult40;                           // 0x1B68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult41;                           // 0x1B90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult42;                           // 0x1BB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult43;                           // 0x1BE0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer44;                             // 0x1C08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult45;                                // 0x1C50   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer46;                             // 0x1C70   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult47;                                // 0x1CB8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer48;                             // 0x1CD8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult49;                                // 0x1D20   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer50;                             // 0x1D40   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult51;                                // 0x1D88   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine52;                               // 0x1DA8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend53;                                // 0x1E70   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator54;                    // 0x1F38   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator55;                    // 0x1FE0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult56;                     // 0x2088   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult57;                           // 0x20A8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend58;                                // 0x20D0   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator59;                    // 0x2198   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator60;                    // 0x2240   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult61;                     // 0x22E8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult62;                           // 0x2308   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend63;                                // 0x2330   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator64;                    // 0x23F8   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator65;                    // 0x24A0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult66;                     // 0x2548   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult67;                           // 0x2568   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult68;                           // 0x2590   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult69;                           // 0x25B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult70;                           // 0x25E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult71;                           // 0x2608   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult72;                           // 0x2630   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x2658   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer74;                             // 0x2680   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult75;                                // 0x26C8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer76;                             // 0x26E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult77;                                // 0x2730   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer78;                             // 0x2750   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult79;                                // 0x2798   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer80;                             // 0x27B8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult81;                                // 0x2800   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine82;                               // 0x2820   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x28E8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer83;                             // 0x2930   (0x0048)  
	TArray<double>                                     Drive_Body_Anim_BlendTime;                                  // 0x2978   (0x0010)  
	TArray<bool>                                       Drive_Body_Anim_Enable;                                     // 0x2988   (0x0010)  
	class UAnimSequenceBase*                           Def_Body_Anim0;                                             // 0x2998   (0x0008)  
	TArray<class UAnimSequenceBase*>                   Drive_Body_Anim;                                            // 0x29A0   (0x0010)  
	TArray<bool>                                       Drive_Body_Anim_Loop;                                       // 0x29B0   (0x0010)  
	int32_t                                            ActiveBodyAnimEnum;                                         // 0x29C0   (0x0004)  
	int32_t                                            NextBodyAnimIndex;                                          // 0x29C4   (0x0004)  
	TArray<double>                                     Drive_Body_Anim_Start;                                      // 0x29C8   (0x0010)  
	TArray<double>                                     Drive_Body_Anim_PlayRate;                                   // 0x29D8   (0x0010)  
	int32_t                                            CurrentBodyAnimIndex;                                       // 0x29E8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x29EC   (0x0004)  MISSED
	TArray<int32_t>                                    BodyAnimSlot;                                               // 0x29F0   (0x0010)  
	TArray<int32_t>                                    UnusedBodyAnimSlot;                                         // 0x2A00   (0x0010)  
	TArray<class UAnimSequenceBase*>                   BodyAnimClips;                                              // 0x2A10   (0x0010)  
	TArray<double>                                     BodyBlendTimes;                                             // 0x2A20   (0x0010)  
	TArray<bool>                                       BodyAnimLoop;                                               // 0x2A30   (0x0010)  
	TArray<double>                                     BodyPlayRate;                                               // 0x2A40   (0x0010)  
	TArray<double>                                     BodyStart;                                                  // 0x2A50   (0x0010)  


	/// Functions
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.CheckUsableSlots
	// void CheckUsableSlots(int32_t CurrentAnimIndex, TArray<int32_t>& UsedElements, TArray<int32_t>& UnusedElements);         // [0x2fd44f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.SetAnimSequence
	// void SetAnimSequence(TArray<FSetAnimSequenceParam>& SetAnimSequenceParam);                                               // [0x2fd44f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_BCBB03D043FF7AEE7224E8A167A4657D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_BCBB03D043FF7AEE7224E8A167A4657D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_E19AAAEC4AFD248BF33A65BC6E702601
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_E19AAAEC4AFD248BF33A65BC6E702601(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_D682275F4A1F2B0D2F4A2BA72343DD8B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_D682275F4A1F2B0D2F4A2BA72343DD8B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_EAD757904DA70BABF3C8C2BC00ED9A36
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_EAD757904DA70BABF3C8C2BC00ED9A36(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_F1C8D5764C519F2834B6BC89631FBC77
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_F1C8D5764C519F2834B6BC89631FBC77(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_B7C79ACA48B739C31D815C9C6009A3C3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_B7C79ACA48B739C31D815C9C6009A3C3(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_E74431A6480DC52D4A0C54AF49756305
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_E74431A6480DC52D4A0C54AF49756305(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_4862BBA94FE5FBF124D41EB3121879E4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_4862BBA94FE5FBF124D41EB3121879E4(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_BlendListByEnum_4BB59059496B894519C3D29BB9F75C9A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_BlendListByEnum_4BB59059496B894519C3D29BB9F75C9A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_E9EFC1764FA1054699B292ABE1B7CBE9
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_E9EFC1764FA1054699B292ABE1B7CBE9(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_5B1907AC4D1B24FDB0ABA0A1219AD505
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_5B1907AC4D1B24FDB0ABA0A1219AD505(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_67DF11DB49C4BCA0D04129ACF7AE9C44
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_67DF11DB49C4BCA0D04129ACF7AE9C44(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_1A6EA90A4007C07B8B94D98ADC46AD2B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_1A6EA90A4007C07B8B94D98ADC46AD2B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_FD061C40411566C3D0D713B19F01787E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_FD061C40411566C3D0D713B19F01787E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_60D970674EF9881B11FEA8B3C1EC5CE7
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_60D970674EF9881B11FEA8B3C1EC5CE7(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_C4D8C407408DFDAF0082559AA931EB00
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_C4D8C407408DFDAF0082559AA931EB00(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_738ADC3E43E5901902F98086690475D2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_738ADC3E43E5901902F98086690475D2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_AE2DFEF84B7CFD3A8830BF87999F7588
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_AE2DFEF84B7CFD3A8830BF87999F7588(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_26620ABE428AC28B7C12FE88DD187B9F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_26620ABE428AC28B7C12FE88DD187B9F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_38AE133E445A14E2F6E5EFA0933B0ECF
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_38AE133E445A14E2F6E5EFA0933B0ECF(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_0AB4E87440E206FAB59FE5A7683FAEEA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_0AB4E87440E206FAB59FE5A7683FAEEA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_A1C5251E4064C397686632BE343C6D45
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_A1C5251E4064C397686632BE343C6D45(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4FAF7A584A4D31B1A15D3E962E5B4071
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4FAF7A584A4D31B1A15D3E962E5B4071(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_982557DA4D1EBA31DB67ADBCE4F1613A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_982557DA4D1EBA31DB67ADBCE4F1613A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_D971480446CA4FC9FB915F90837D9E72
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_D971480446CA4FC9FB915F90837D9E72(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_5E40D79C42744C60C64827AACD93F27D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_5E40D79C42744C60C64827AACD93F27D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_5BC639154926CC3249E04391428015FA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_5BC639154926CC3249E04391428015FA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_411DEDB645B27616F84703992438B6CC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_411DEDB645B27616F84703992438B6CC(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_50062220431DDBCBBF2893A50FCDB8EC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_50062220431DDBCBBF2893A50FCDB8EC(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_18F278E14A2A884AC812179DD2BC4701
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_18F278E14A2A884AC812179DD2BC4701(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_85CA20E6474223B61FEFC29935B1E4E1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_85CA20E6474223B61FEFC29935B1E4E1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_AF0C3602469523070CA9FCA7EA908F38
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_SequencePlayer_AF0C3602469523070CA9FCA7EA908F38(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4E9622A645C491CFFCF8DF82A19EC799
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4E9622A645C491CFFCF8DF82A19EC799(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_8222739F4824B7CBAAD1D3AE915C575D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_8222739F4824B7CBAAD1D3AE915C575D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_F0C2FBC84D5497338DD1C2B5CDE0C511
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_F0C2FBC84D5497338DD1C2B5CDE0C511(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_63C550B049BF3168F42AE39EBB14A299
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_63C550B049BF3168F42AE39EBB14A299(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4049A8DA4BA224E6804341B467784F96
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_4049A8DA4BA224E6804341B467784F96(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_0E7D6AAA4FD8B0775C387FA644953FB9
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TransitionResult_0E7D6AAA4FD8B0775C387FA644953FB9(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_B495DA4549A4F8C0D61CB2A4A30B6327
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_B495DA4549A4F8C0D61CB2A4A30B6327(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_A5923A634669FC3C21B4BCBECB101B2F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP_AnimGraphNode_TwoWayBlend_A5923A634669FC3C21B4BCBECB101B2F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP
	// void ExecuteUbergraph_mdl_ase0030_megamisou_AnimBP(int32_t EntryPoint);                                                  // [0x2fd44f0] Final                
};

/// Class /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C
/// Size: 0x301B (12315 bytes) (0x000898 - 0x00301B) align 16 MaxSize: 0x301B
class UCharaModelSkeleton_AnimBP_C : public UCharaAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0898   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x08A0   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[168]; // 0x08A8   (0x00A8)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0950   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0958   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0960   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x0980   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator;                      // 0x0A48   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator0;                     // 0x0AF0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult;                       // 0x0B98   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0BB8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend1;                                 // 0x0BE0   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator2;                     // 0x0CA8   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator3;                     // 0x0D50   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult4;                      // 0x0DF8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0E18   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend6;                                 // 0x0E40   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator7;                     // 0x0F08   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator8;                     // 0x0FB0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult9;                      // 0x1058   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x1078   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x10A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x10C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x10F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x1118   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x1140   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x1168   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1190   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x11D8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x11F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult18;                                // 0x1240   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer19;                             // 0x1260   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult20;                                // 0x12A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer21;                             // 0x12C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult22;                                // 0x1310   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1330   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend23;                                // 0x13F8   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator24;                    // 0x14C0   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator25;                    // 0x1568   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult26;                     // 0x1610   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x1630   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend28;                                // 0x1658   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator29;                    // 0x1720   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator30;                    // 0x17C8   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult31;                     // 0x1870   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x1890   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend33;                                // 0x18B8   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator34;                    // 0x1980   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator35;                    // 0x1A28   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult36;                     // 0x1AD0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult37;                           // 0x1AF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult38;                           // 0x1B18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult39;                           // 0x1B40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult40;                           // 0x1B68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult41;                           // 0x1B90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult42;                           // 0x1BB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult43;                           // 0x1BE0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer44;                             // 0x1C08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult45;                                // 0x1C50   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer46;                             // 0x1C70   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult47;                                // 0x1CB8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer48;                             // 0x1CD8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult49;                                // 0x1D20   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer50;                             // 0x1D40   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult51;                                // 0x1D88   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine52;                               // 0x1DA8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend53;                                // 0x1E70   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator54;                    // 0x1F38   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator55;                    // 0x1FE0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult56;                     // 0x2088   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult57;                           // 0x20A8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend58;                                // 0x20D0   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator59;                    // 0x2198   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator60;                    // 0x2240   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult61;                     // 0x22E8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult62;                           // 0x2308   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend63;                                // 0x2330   (0x00C8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator64;                    // 0x23F8   (0x00A8)  
	FAnimNode_TransitionPoseEvaluator                  AnimGraphNode_TransitionPoseEvaluator65;                    // 0x24A0   (0x00A8)  
	FAnimNode_StateResult                              AnimGraphNode_CustomTransitionResult66;                     // 0x2548   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult67;                           // 0x2568   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult68;                           // 0x2590   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult69;                           // 0x25B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult70;                           // 0x25E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult71;                           // 0x2608   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult72;                           // 0x2630   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x2658   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer74;                             // 0x2680   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult75;                                // 0x26C8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer76;                             // 0x26E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult77;                                // 0x2730   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer78;                             // 0x2750   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult79;                                // 0x2798   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer80;                             // 0x27B8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult81;                                // 0x2800   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine82;                               // 0x2820   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x28E8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer83;                             // 0x2930   (0x0048)  
	FAnimNode_ControlRig                               AnimGraphNode_ControlRig;                                   // 0x2978   (0x04D0)  
	double                                             __CustomProperty_ReleaseSeconds_922C4F354D69D0487E849EA014C131D8; // 0x2E48   (0x0008)  
	bool                                               __CustomProperty_LookAtEnable_922C4F354D69D0487E849EA014C131D8; // 0x2E50   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x2E51   (0x000F)  MISSED
	FTransform                                         __CustomProperty_LookAtTransform_922C4F354D69D0487E849EA014C131D8; // 0x2E60   (0x0060)  
	TArray<double>                                     Drive_Body_Anim_BlendTime;                                  // 0x2EC0   (0x0010)  
	TArray<bool>                                       Drive_Body_Anim_Enable;                                     // 0x2ED0   (0x0010)  
	class UAnimSequenceBase*                           Def_Body_Anim0;                                             // 0x2EE0   (0x0008)  
	TArray<class UAnimSequenceBase*>                   Drive_Body_Anim;                                            // 0x2EE8   (0x0010)  
	TArray<bool>                                       Drive_Body_Anim_Loop;                                       // 0x2EF8   (0x0010)  
	int32_t                                            ActiveBodyAnimEnum;                                         // 0x2F08   (0x0004)  
	int32_t                                            NextBodyAnimIndex;                                          // 0x2F0C   (0x0004)  
	TArray<double>                                     Drive_Body_Anim_Start;                                      // 0x2F10   (0x0010)  
	TArray<double>                                     Drive_Body_Anim_PlayRate;                                   // 0x2F20   (0x0010)  
	int32_t                                            CurrentBodyAnimIndex;                                       // 0x2F30   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x2F34   (0x0004)  MISSED
	TArray<int32_t>                                    BodyAnimSlot;                                               // 0x2F38   (0x0010)  
	TArray<int32_t>                                    UnusedBodyAnimSlot;                                         // 0x2F48   (0x0010)  
	TArray<class UAnimSequenceBase*>                   BodyAnimClips;                                              // 0x2F58   (0x0010)  
	TArray<double>                                     BodyBlendTimes;                                             // 0x2F68   (0x0010)  
	TArray<bool>                                       BodyAnimLoop;                                               // 0x2F78   (0x0010)  
	TArray<double>                                     BodyPlayRate;                                               // 0x2F88   (0x0010)  
	TArray<double>                                     BodyStart;                                                  // 0x2F98   (0x0010)  
	bool                                               LookAtEnable;                                               // 0x2FA8   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x2FA9   (0x0007)  MISSED
	FTransform                                         LookAtTransform;                                            // 0x2FB0   (0x0060)  
	double                                             LookAtReleaseSeconds;                                       // 0x3010   (0x0008)  
	bool                                               BlinkEyeEnable;                                             // 0x3018   (0x0001)  
	bool                                               TalkMouthEnable;                                            // 0x3019   (0x0001)  
	bool                                               EyebrowEnable;                                              // 0x301A   (0x0001)  


	/// Functions
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetEyebrowEnable
	// void SetEyebrowEnable(bool IsEnable);                                                                                    // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetTalkMouthEnable
	// void SetTalkMouthEnable(bool IsEnable);                                                                                  // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetBlinkEyeEnable
	// void SetBlinkEyeEnable(bool IsEnable);                                                                                   // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetLookAtReleaseSeconds
	// void SetLookAtReleaseSeconds(FSetLookAtReleaseSecondsParam Seconds);                                                     // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.CheckUsableSlots
	// void CheckUsableSlots(int32_t CurrentAnimIndex, TArray<int32_t>& UsedElements, TArray<int32_t>& UnusedElements);         // [0x2fd44f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetAnimSequence
	// void SetAnimSequence(TArray<FSetAnimSequenceParam>& SetAnimSequenceParam);                                               // [0x2fd44f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_876EF8ED4EBFD4C766C4CEBFCB49F5C1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_876EF8ED4EBFD4C766C4CEBFCB49F5C1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_740815CC438466BE806D7FBA48DD2D35
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_740815CC438466BE806D7FBA48DD2D35(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_35BD027B4C634754C0A131BAF15BE0D3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_35BD027B4C634754C0A131BAF15BE0D3(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_5433A4F145F24762BB3B1D9AEE2EC5DC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_5433A4F145F24762BB3B1D9AEE2EC5DC(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_CA5C2A254D23639B2E48DCA69598DCA8
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_CA5C2A254D23639B2E48DCA69598DCA8(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_ED71E416425B0262D84C28A0D72C677B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_ED71E416425B0262D84C28A0D72C677B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7EE5CFD743599291B1ACC793F6DA959E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7EE5CFD743599291B1ACC793F6DA959E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_C6FBC3B948D35058009AF380E31F0366
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_C6FBC3B948D35058009AF380E31F0366(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_BlendListByEnum_E474F9A648542EA4D9DB80B5397F84CA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_BlendListByEnum_E474F9A648542EA4D9DB80B5397F84CA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_EF45A0504A560D7D4C892193D8E06B34
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_EF45A0504A560D7D4C892193D8E06B34(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_999872C1402951B79E4EE088A21B3C8F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_999872C1402951B79E4EE088A21B3C8F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_4BF9B4C94666FE9403099FAB2DE3DD6E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_4BF9B4C94666FE9403099FAB2DE3DD6E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_582FDDA14951D4E3678A1A844AC8A2F6
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_582FDDA14951D4E3678A1A844AC8A2F6(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_5E1B269346C87FBF2EE2DCB58C2535D0
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_5E1B269346C87FBF2EE2DCB58C2535D0(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_258D09034B76861B491CB7892CEE5625
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_258D09034B76861B491CB7892CEE5625(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_CFE8035347B21C3588718AAA2EB36C05
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_CFE8035347B21C3588718AAA2EB36C05(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_9344E4194B963AE4641FE9A3585720B2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_9344E4194B963AE4641FE9A3585720B2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_D33CFC0B4002BB48EC7D50968766F44A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_D33CFC0B4002BB48EC7D50968766F44A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7A255F674874DA67C4B138BEA65DE457
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7A255F674874DA67C4B138BEA65DE457(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_870AA9A4463E93DE6B1A088D8F7CA28E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_870AA9A4463E93DE6B1A088D8F7CA28E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_FECF4E0547B9241FBA5FCC94A9BC4494
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_FECF4E0547B9241FBA5FCC94A9BC4494(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_B1EE5BB844CD203816F5079A5876E401
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_B1EE5BB844CD203816F5079A5876E401(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_CBFA02634AAAE3A69CE131828DA883E8
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_CBFA02634AAAE3A69CE131828DA883E8(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_F499C795488D2AC918730B832564F76B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_F499C795488D2AC918730B832564F76B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_4CF8849846E89DF47E8F8DA0CF623719
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_4CF8849846E89DF47E8F8DA0CF623719(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_AB19220744D9D52B5101FF9F2B02C0FC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_AB19220744D9D52B5101FF9F2B02C0FC(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_12E0999648F67E176CE21FA8FB2C900D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_12E0999648F67E176CE21FA8FB2C900D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_E4E100E44ED3390AC658098898E82C7C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_E4E100E44ED3390AC658098898E82C7C(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_085CFD554AE5DC59C69E3FB1BB4D8CA4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_085CFD554AE5DC59C69E3FB1BB4D8CA4(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_E8E68796447538FAD71200BBFA9E14CA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_E8E68796447538FAD71200BBFA9E14CA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_74DC7D674E11F382507D2FAD19C0CA89
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_74DC7D674E11F382507D2FAD19C0CA89(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7ABB1FA9483C516A97F6D4B08056B175
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_SequencePlayer_7ABB1FA9483C516A97F6D4B08056B175(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_D0D1394F4E536050BD0DEC8AF39FE22F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_D0D1394F4E536050BD0DEC8AF39FE22F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_B172DDF04284D0C3A44171B5D2D9FCB2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_B172DDF04284D0C3A44171B5D2D9FCB2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_61187453409BD65AAE640EBC5B2541A5
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_61187453409BD65AAE640EBC5B2541A5(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_64A02B774990B2D155E056B7011A5C2A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_64A02B774990B2D155E056B7011A5C2A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_368F06ED409C984C31F3C0B7A9636E95
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_368F06ED409C984C31F3C0B7A9636E95(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_700566D749035B7D8865DCB710461E83
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TransitionResult_700566D749035B7D8865DCB710461E83(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_3540113A4004383B2232429F33424DC1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_3540113A4004383B2232429F33424DC1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_9091B6C54CF6ABDFCDB253830B2E72FF
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_CharaModelSkeleton_AnimBP_AnimGraphNode_TwoWayBlend_9091B6C54CF6ABDFCDB253830B2E72FF(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.SetTransformAndEnable
	// void SetTransformAndEnable(bool LookAtEnable, FTransform LookAtTransform);                                               // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.Set Release Time
	// void SetReleaseTime(double Seconds);                                                                                     // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.BlueprintPostEvaluateAnimation
	// void BlueprintPostEvaluateAnimation();                                                                                   // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.ExecuteUbergraph_CharaModelSkeleton_AnimBP
	// void ExecuteUbergraph_CharaModelSkeleton_AnimBP(int32_t EntryPoint);                                                     // [0x2fd44f0] Final|HasDefaults    
};

/// Class /Game/Evt/_blueprints/AnimBP/EventCharaLookAtInterface.EventCharaLookAtInterface_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UEventCharaLookAtInterface_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Evt/_blueprints/AnimBP/EventCharaLookAtInterface.EventCharaLookAtInterface_C.Set Release Time
	// void SetReleaseTime(double Seconds);                                                                                     // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Evt/_blueprints/AnimBP/EventCharaLookAtInterface.EventCharaLookAtInterface_C.SetTransformAndEnable
	// void SetTransformAndEnable(bool LookAtEnable, FTransform LookAtTransform);                                               // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
};

/// Struct /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x00A1 (161 bytes) (0x000001 - 0x0000A1) align 8 MaxSize: 0x00A1
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	float                                              __FloatProperty0;                                           // 0x0008   (0x0004)  
	bool                                               __BoolProperty1;                                            // 0x000C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              __FloatProperty2;                                           // 0x0010   (0x0004)  
	float                                              __FloatProperty3;                                           // 0x0014   (0x0004)  
	bool                                               __BoolProperty4;                                            // 0x0018   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0019   (0x0003)  MISSED
	float                                              __FloatProperty5;                                           // 0x001C   (0x0004)  
	float                                              __FloatProperty6;                                           // 0x0020   (0x0004)  
	bool                                               __BoolProperty7;                                            // 0x0024   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              __FloatProperty8;                                           // 0x0028   (0x0004)  
	float                                              __FloatProperty9;                                           // 0x002C   (0x0004)  
	bool                                               __BoolProperty10;                                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              __FloatProperty11;                                          // 0x0034   (0x0004)  
	float                                              __FloatProperty12;                                          // 0x0038   (0x0004)  
	bool                                               __BoolProperty13;                                           // 0x003C   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x003D   (0x0003)  MISSED
	float                                              __FloatProperty14;                                          // 0x0040   (0x0004)  
	float                                              __FloatProperty15;                                          // 0x0044   (0x0004)  
	bool                                               __BoolProperty16;                                           // 0x0048   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0049   (0x0003)  MISSED
	float                                              __FloatProperty17;                                          // 0x004C   (0x0004)  
	float                                              __FloatProperty18;                                          // 0x0050   (0x0004)  
	bool                                               __BoolProperty19;                                           // 0x0054   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x0055   (0x0003)  MISSED
	float                                              __FloatProperty20;                                          // 0x0058   (0x0004)  
	float                                              __FloatProperty21;                                          // 0x005C   (0x0004)  
	bool                                               __BoolProperty22;                                           // 0x0060   (0x0001)  
	unsigned char                                      UnknownData08_6[0x3];                                       // 0x0061   (0x0003)  MISSED
	float                                              __FloatProperty23;                                          // 0x0064   (0x0004)  
	float                                              __FloatProperty24;                                          // 0x0068   (0x0004)  
	bool                                               __BoolProperty25;                                           // 0x006C   (0x0001)  
	unsigned char                                      UnknownData09_6[0x3];                                       // 0x006D   (0x0003)  MISSED
	float                                              __FloatProperty26;                                          // 0x0070   (0x0004)  
	float                                              __FloatProperty27;                                          // 0x0074   (0x0004)  
	bool                                               __BoolProperty28;                                           // 0x0078   (0x0001)  
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x0079   (0x0003)  MISSED
	float                                              __FloatProperty29;                                          // 0x007C   (0x0004)  
	float                                              __FloatProperty30;                                          // 0x0080   (0x0004)  
	bool                                               __BoolProperty31;                                           // 0x0084   (0x0001)  
	unsigned char                                      UnknownData11_6[0x3];                                       // 0x0085   (0x0003)  MISSED
	float                                              __FloatProperty32;                                          // 0x0088   (0x0004)  
	float                                              __FloatProperty33;                                          // 0x008C   (0x0004)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0090   (0x0010)  
	char                                               __ByteProperty;                                             // 0x00A0   (0x0001)  
};

/// Struct /Game/Evt/_blueprints/AnimBP/mdl_ase0030_megamisou_AnimBP.mdl_ase0030_megamisou_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x12E8 (4840 bytes) (0x000001 - 0x0012E8) align 8 MaxSize: 0x12E8
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_8[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty0;                                            // 0x000C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	FName                                              __NameProperty1;                                            // 0x0018   (0x0008)  
	int32_t                                            __IntProperty2;                                             // 0x0020   (0x0004)  
	FName                                              __NameProperty3;                                            // 0x0024   (0x0008)  
	int32_t                                            __IntProperty4;                                             // 0x002C   (0x0004)  
	FName                                              __NameProperty5;                                            // 0x0030   (0x0008)  
	int32_t                                            __IntProperty6;                                             // 0x0038   (0x0004)  
	FName                                              __NameProperty7;                                            // 0x003C   (0x0008)  
	FName                                              __NameProperty8;                                            // 0x0044   (0x0008)  
	int32_t                                            __IntProperty9;                                             // 0x004C   (0x0004)  
	class UBlendProfile*                               __BlendProfile;                                             // 0x0050   (0x0008)  
	class UCurveFloat*                                 __CurveFloat;                                               // 0x0058   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0060   (0x0001)  
	EBlendListTransitionType                           __EnumProperty10;                                           // 0x0061   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x0062   (0x0006)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0068   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0078   (0x0020)  
	bool                                               __BoolProperty;                                             // 0x0098   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0099   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x009C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty11;                                         // 0x00A0   (0x002C)  
	float                                              __FloatProperty12;                                          // 0x00CC   (0x0004)  
	bool                                               __BoolProperty13;                                           // 0x00D0   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty14;                                           // 0x00D1   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x00D2   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x00D3   (0x0001)  MISSED
	FName                                              __NameProperty15;                                           // 0x00D4   (0x0008)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x00DC   (0x0004)  MISSED
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00E0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0160   (0x0018)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root;                                         // 0x0178   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend;                                  // 0x01A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator;                      // 0x01D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator16;                    // 0x0208   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult;                       // 0x0238   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult;                             // 0x0268   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend17;                                // 0x0298   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator18;                    // 0x02C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator19;                    // 0x02F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult20;                     // 0x0328   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult21;                           // 0x0358   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend22;                                // 0x0388   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator23;                    // 0x03B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator24;                    // 0x03E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult25;                     // 0x0418   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult26;                           // 0x0448   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult27;                           // 0x0478   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult28;                           // 0x04A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult29;                           // 0x04D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult30;                           // 0x0508   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult31;                           // 0x0538   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult32;                           // 0x0568   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer;                               // 0x0598   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult;                                  // 0x05C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer33;                             // 0x05F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult34;                                // 0x0628   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer35;                             // 0x0658   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult36;                                // 0x0688   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer37;                             // 0x06B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult38;                                // 0x06E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine;                                 // 0x0718   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend39;                                // 0x0748   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator40;                    // 0x0778   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator41;                    // 0x07A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult42;                     // 0x07D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult43;                           // 0x0808   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend44;                                // 0x0838   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator45;                    // 0x0868   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator46;                    // 0x0898   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult47;                     // 0x08C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult48;                           // 0x08F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend49;                                // 0x0928   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator50;                    // 0x0958   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator51;                    // 0x0988   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult52;                     // 0x09B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult53;                           // 0x09E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult54;                           // 0x0A18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult55;                           // 0x0A48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult56;                           // 0x0A78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult57;                           // 0x0AA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult58;                           // 0x0AD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult59;                           // 0x0B08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer60;                             // 0x0B38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult61;                                // 0x0B68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer62;                             // 0x0B98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult63;                                // 0x0BC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer64;                             // 0x0BF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult65;                                // 0x0C28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer66;                             // 0x0C58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult67;                                // 0x0C88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine68;                               // 0x0CB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend69;                                // 0x0CE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator70;                    // 0x0D18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator71;                    // 0x0D48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult72;                     // 0x0D78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult73;                           // 0x0DA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend74;                                // 0x0DD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator75;                    // 0x0E08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator76;                    // 0x0E38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult77;                     // 0x0E68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult78;                           // 0x0E98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend79;                                // 0x0EC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator80;                    // 0x0EF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator81;                    // 0x0F28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult82;                     // 0x0F58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult83;                           // 0x0F88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult84;                           // 0x0FB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult85;                           // 0x0FE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult86;                           // 0x1018   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult87;                           // 0x1048   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult88;                           // 0x1078   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult89;                           // 0x10A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer90;                             // 0x10D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult91;                                // 0x1108   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer92;                             // 0x1138   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult93;                                // 0x1168   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer94;                             // 0x1198   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult95;                                // 0x11C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer96;                             // 0x11F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult97;                                // 0x1228   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine98;                               // 0x1258   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByEnum;                              // 0x1288   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer99;                             // 0x12B8   (0x0030)  
};

/// Struct /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x00A1 (161 bytes) (0x000001 - 0x0000A1) align 8 MaxSize: 0x00A1
struct FAnimBlueprintGeneratedMutableDatadup_0 : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	float                                              __FloatProperty0;                                           // 0x0008   (0x0004)  
	bool                                               __BoolProperty1;                                            // 0x000C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              __FloatProperty2;                                           // 0x0010   (0x0004)  
	float                                              __FloatProperty3;                                           // 0x0014   (0x0004)  
	bool                                               __BoolProperty4;                                            // 0x0018   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0019   (0x0003)  MISSED
	float                                              __FloatProperty5;                                           // 0x001C   (0x0004)  
	float                                              __FloatProperty6;                                           // 0x0020   (0x0004)  
	bool                                               __BoolProperty7;                                            // 0x0024   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              __FloatProperty8;                                           // 0x0028   (0x0004)  
	float                                              __FloatProperty9;                                           // 0x002C   (0x0004)  
	bool                                               __BoolProperty10;                                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              __FloatProperty11;                                          // 0x0034   (0x0004)  
	float                                              __FloatProperty12;                                          // 0x0038   (0x0004)  
	bool                                               __BoolProperty13;                                           // 0x003C   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x003D   (0x0003)  MISSED
	float                                              __FloatProperty14;                                          // 0x0040   (0x0004)  
	float                                              __FloatProperty15;                                          // 0x0044   (0x0004)  
	bool                                               __BoolProperty16;                                           // 0x0048   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0049   (0x0003)  MISSED
	float                                              __FloatProperty17;                                          // 0x004C   (0x0004)  
	float                                              __FloatProperty18;                                          // 0x0050   (0x0004)  
	bool                                               __BoolProperty19;                                           // 0x0054   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x0055   (0x0003)  MISSED
	float                                              __FloatProperty20;                                          // 0x0058   (0x0004)  
	float                                              __FloatProperty21;                                          // 0x005C   (0x0004)  
	bool                                               __BoolProperty22;                                           // 0x0060   (0x0001)  
	unsigned char                                      UnknownData08_6[0x3];                                       // 0x0061   (0x0003)  MISSED
	float                                              __FloatProperty23;                                          // 0x0064   (0x0004)  
	float                                              __FloatProperty24;                                          // 0x0068   (0x0004)  
	bool                                               __BoolProperty25;                                           // 0x006C   (0x0001)  
	unsigned char                                      UnknownData09_6[0x3];                                       // 0x006D   (0x0003)  MISSED
	float                                              __FloatProperty26;                                          // 0x0070   (0x0004)  
	float                                              __FloatProperty27;                                          // 0x0074   (0x0004)  
	bool                                               __BoolProperty28;                                           // 0x0078   (0x0001)  
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x0079   (0x0003)  MISSED
	float                                              __FloatProperty29;                                          // 0x007C   (0x0004)  
	float                                              __FloatProperty30;                                          // 0x0080   (0x0004)  
	bool                                               __BoolProperty31;                                           // 0x0084   (0x0001)  
	unsigned char                                      UnknownData11_6[0x3];                                       // 0x0085   (0x0003)  MISSED
	float                                              __FloatProperty32;                                          // 0x0088   (0x0004)  
	float                                              __FloatProperty33;                                          // 0x008C   (0x0004)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0090   (0x0010)  
	char                                               __ByteProperty;                                             // 0x00A0   (0x0001)  
};

/// Struct /Game/Evt/_blueprints/AnimBP/CharaModelSkeleton_AnimBP.CharaModelSkeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x1318 (4888 bytes) (0x000001 - 0x001318) align 8 MaxSize: 0x1318
struct FAnimBlueprintGeneratedConstantDatadup_1 : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_8[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty0;                                            // 0x000C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	FName                                              __NameProperty1;                                            // 0x0018   (0x0008)  
	int32_t                                            __IntProperty2;                                             // 0x0020   (0x0004)  
	FName                                              __NameProperty3;                                            // 0x0024   (0x0008)  
	int32_t                                            __IntProperty4;                                             // 0x002C   (0x0004)  
	FName                                              __NameProperty5;                                            // 0x0030   (0x0008)  
	int32_t                                            __IntProperty6;                                             // 0x0038   (0x0004)  
	FName                                              __NameProperty7;                                            // 0x003C   (0x0008)  
	FName                                              __NameProperty8;                                            // 0x0044   (0x0008)  
	int32_t                                            __IntProperty9;                                             // 0x004C   (0x0004)  
	class UBlendProfile*                               __BlendProfile;                                             // 0x0050   (0x0008)  
	class UCurveFloat*                                 __CurveFloat;                                               // 0x0058   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0060   (0x0001)  
	EBlendListTransitionType                           __EnumProperty10;                                           // 0x0061   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x0062   (0x0006)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0068   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0078   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0079   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x007C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0080   (0x002C)  
	float                                              __FloatProperty11;                                          // 0x00AC   (0x0004)  
	bool                                               __BoolProperty12;                                           // 0x00B0   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty13;                                           // 0x00B1   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x00B2   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x00B3   (0x0001)  MISSED
	FName                                              __NameProperty14;                                           // 0x00B4   (0x0008)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x00BC   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty15;                                         // 0x00C0   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00E0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0160   (0x0018)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root;                                         // 0x0178   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend;                                  // 0x01A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator;                      // 0x01D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator16;                    // 0x0208   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult;                       // 0x0238   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult;                             // 0x0268   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend17;                                // 0x0298   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator18;                    // 0x02C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator19;                    // 0x02F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult20;                     // 0x0328   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult21;                           // 0x0358   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend22;                                // 0x0388   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator23;                    // 0x03B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator24;                    // 0x03E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult25;                     // 0x0418   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult26;                           // 0x0448   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult27;                           // 0x0478   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult28;                           // 0x04A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult29;                           // 0x04D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult30;                           // 0x0508   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult31;                           // 0x0538   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult32;                           // 0x0568   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer;                               // 0x0598   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult;                                  // 0x05C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer33;                             // 0x05F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult34;                                // 0x0628   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer35;                             // 0x0658   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult36;                                // 0x0688   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer37;                             // 0x06B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult38;                                // 0x06E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine;                                 // 0x0718   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend39;                                // 0x0748   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator40;                    // 0x0778   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator41;                    // 0x07A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult42;                     // 0x07D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult43;                           // 0x0808   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend44;                                // 0x0838   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator45;                    // 0x0868   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator46;                    // 0x0898   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult47;                     // 0x08C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult48;                           // 0x08F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend49;                                // 0x0928   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator50;                    // 0x0958   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator51;                    // 0x0988   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult52;                     // 0x09B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult53;                           // 0x09E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult54;                           // 0x0A18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult55;                           // 0x0A48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult56;                           // 0x0A78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult57;                           // 0x0AA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult58;                           // 0x0AD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult59;                           // 0x0B08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer60;                             // 0x0B38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult61;                                // 0x0B68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer62;                             // 0x0B98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult63;                                // 0x0BC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer64;                             // 0x0BF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult65;                                // 0x0C28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer66;                             // 0x0C58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult67;                                // 0x0C88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine68;                               // 0x0CB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend69;                                // 0x0CE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator70;                    // 0x0D18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator71;                    // 0x0D48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult72;                     // 0x0D78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult73;                           // 0x0DA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend74;                                // 0x0DD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator75;                    // 0x0E08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator76;                    // 0x0E38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult77;                     // 0x0E68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult78;                           // 0x0E98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TwoWayBlend79;                                // 0x0EC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator80;                    // 0x0EF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionPoseEvaluator81;                    // 0x0F28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_CustomTransitionResult82;                     // 0x0F58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult83;                           // 0x0F88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult84;                           // 0x0FB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult85;                           // 0x0FE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult86;                           // 0x1018   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult87;                           // 0x1048   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult88;                           // 0x1078   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult89;                           // 0x10A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer90;                             // 0x10D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult91;                                // 0x1108   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer92;                             // 0x1138   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult93;                                // 0x1168   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer94;                             // 0x1198   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult95;                                // 0x11C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer96;                             // 0x11F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult97;                                // 0x1228   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine98;                               // 0x1258   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByEnum;                              // 0x1288   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer99;                             // 0x12B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ControlRig;                                   // 0x12E8   (0x0030)  
};

#pragma pack(pop)


