
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimGraphRuntime
/// dependency: CharamakeBoneModify
/// dependency: common
/// dependency: ControlRig
/// dependency: CoreUObject
/// dependency: DP1Project
/// dependency: Engine
/// dependency: Evt
/// dependency: KawaiiPhysics
/// dependency: Niagara
/// dependency: Program
/// dependency: RigVM

#pragma pack(push, 0x1)

/// Class /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Body_AnimBP.Avatar_Body_AnimBP_C
/// Size: 0x0500 (1280 bytes) (0x000368 - 0x000500) align 16 MaxSize: 0x0500
class UAvatar_Body_AnimBP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x03A8   (0x0158)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Body_AnimBP.Avatar_Body_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Body_AnimBP.Avatar_Body_AnimBP_C.ExecuteUbergraph_Avatar_Body_AnimBP
	// void ExecuteUbergraph_Avatar_Body_AnimBP(int32_t EntryPoint);                                                            // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Fishing_LookIK.Avatar_Fishing_LookIK_C
/// Size: 0x0B79 (2937 bytes) (0x000368 - 0x000B79) align 16 MaxSize: 0x0B79
class UAvatar_Fishing_LookIK_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[32]; // 0x0378   (0x0020)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0398   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x03A0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x03A8   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x03C8   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0410   (0x0028)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0438   (0x0020)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0458   (0x0008)  MISSED
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0460   (0x0250)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x06B0   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x06D0   (0x0080)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0750   (0x00B8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose0;                              // 0x0808   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose1;                               // 0x0888   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose2;                               // 0x08B0   (0x0028)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x08D8   (0x0008)  MISSED
	FAnimNode_LookAt                                   AnimGraphNode_LookAt3;                                      // 0x08E0   (0x0250)  
	FANIM_INSTANCE_LOOK_IK_PARAM                       LookIKParam;                                                // 0x0B30   (0x0048)  
	bool                                               UseLookIK;                                                  // 0x0B78   (0x0001)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Fishing_LookIK.Avatar_Fishing_LookIK_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Fishing_LookIK.Avatar_Fishing_LookIK_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_Fishing_LookIK_AnimGraphNode_LookAt_98CC7617476973DAA337B09D4741250D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_Fishing_LookIK_AnimGraphNode_LookAt_98CC7617476973DAA337B09D4741250D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Fishing_LookIK.Avatar_Fishing_LookIK_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_Fishing_LookIK.Avatar_Fishing_LookIK_C.ExecuteUbergraph_Avatar_Fishing_LookIK
	// void ExecuteUbergraph_Avatar_Fishing_LookIK(int32_t EntryPoint);                                                         // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/_AnimBP/avt000000/Avatar_BoneModify_AnimBP.Avatar_BoneModify_AnimBP_C
/// Size: 0x0728 (1832 bytes) (0x000368 - 0x000728) align 16 MaxSize: 0x0728
class UAvatar_BoneModify_AnimBP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_CharamakeBoneModify                      AnimGraphNode_CharamakeBoneModify;                          // 0x03A8   (0x0228)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x05D0   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x05F0   (0x00B8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x06A8   (0x0020)  
	TMap<FName, FBoneSizeInfo>                         BoneInfo;                                                   // 0x06C8   (0x0050)  
	FBoneSizeInfoList                                  Bone_Size_Info_List;                                        // 0x0718   (0x0010)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_BoneModify_AnimBP.Avatar_BoneModify_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_BoneModify_AnimBP.Avatar_BoneModify_AnimBP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_BoneModify_AnimBP.Avatar_BoneModify_AnimBP_C.ExecuteUbergraph_Avatar_BoneModify_AnimBP
	// void ExecuteUbergraph_Avatar_BoneModify_AnimBP(int32_t EntryPoint);                                                      // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Weapon/wpn0000/wpn000011/Mdl/wpn000011_PostAnimBP.wpn000011_PostAnimBP_C
/// Size: 0x1480 (5248 bytes) (0x000368 - 0x001480) align 16 MaxSize: 0x1480
class Uwpn000011_PostAnimBP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x03A8   (0x00B8)  
	FAnimNode_KawaiiPhysics                            AnimGraphNode_KawaiiPhysics;                                // 0x0460   (0x07F0)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0C50   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0C70   (0x0020)  
	FAnimNode_KawaiiPhysics                            AnimGraphNode_KawaiiPhysics0;                               // 0x0C90   (0x07F0)  


	/// Functions
	// Function /Game/Graphics/3D/Weapon/wpn0000/wpn000011/Mdl/wpn000011_PostAnimBP.wpn000011_PostAnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Weapon/wpn0000/wpn000011/Mdl/wpn000011_PostAnimBP.wpn000011_PostAnimBP_C.ExecuteUbergraph_wpn000011_PostAnimBP
	// void ExecuteUbergraph_wpn000011_PostAnimBP(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C
/// Size: 0x03D8 (984 bytes) (0x000308 - 0x0003D8) align 8 MaxSize: 0x03D8
class ABP_DynamicSky_C : public ADynamicSkyBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0308   (0x0008)  
	class UExponentialHeightFogComponent*              ExponentialHeightFog;                                       // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SkySphere;                                                  // 0x0318   (0x0008)  
	class UDirectionalLightComponent*                  DirectionalLight;                                           // 0x0320   (0x0008)  
	class USkyLightComponent*                          SkyLight;                                                   // 0x0328   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0330   (0x0008)  
	double                                             timeRate;                                                   // 0x0338   (0x0008)  
	double                                             RepeatHalfTimeRate;                                         // 0x0340   (0x0008)  
	double                                             skyGameTime;                                                // 0x0348   (0x0008)  
	class UMapEnvParamAsset*                           DefaultEnvParamAsset;                                       // 0x0350   (0x0008)  
	TMap<EWeatherType, class UMapEnvParamAsset*>       EnvParamList;                                               // 0x0358   (0x0050)  
	class UMapEnvParamAsset*                           NowEnvParam;                                                // 0x03A8   (0x0008)  
	class UMapEnvParamAsset*                           overwriteEnvParam;                                          // 0x03B0   (0x0008)  
	FMapEnvUpdateInfo                                  DefaultEnvParam;                                            // 0x03B8   (0x0020)  


	/// Functions
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetHDRSceneColorMultiplier
	// float GetHDRSceneColorMultiplier();                                                                                      // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateHDRParams
	// void UpdateHDRParams();                                                                                                  // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetDirLightRot
	// FRotator GetDirLightRot();                                                                                               // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetCommonParamWaterColor
	// FLinearColor GetCommonParamWaterColor();                                                                                 // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetCommonParamSmokeColor
	// FLinearColor GetCommonParamSmokeColor();                                                                                 // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetCommonParamEmissiveRate
	// float GetCommonParamEmissiveRate();                                                                                      // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetCommonParamSkinColor
	// FLinearColor GetCommonParamSkinColor();                                                                                  // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetSkyParamSkyColor1
	// FLinearColor GetSkyParamSkyColor1();                                                                                     // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetSkyParamSkyColor0
	// FLinearColor GetSkyParamSkyColor0();                                                                                     // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetPostParamColorFilterBottom
	// FLinearColor GetPostParamColorFilterBottom();                                                                            // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetPostParamColorFilterTop
	// FLinearColor GetPostParamColorFilterTop();                                                                               // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetSkyParamGroundColor
	// FLinearColor GetSkyParamGroundColor();                                                                                   // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetHeightFogStartDistance
	// float GetHeightFogStartDistance();                                                                                       // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetHeightFogInscatteringColor
	// FLinearColor GetHeightFogInscatteringColor();                                                                            // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetHeightFogDensity
	// float GetHeightFogDensity();                                                                                             // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetDirLightIntensity
	// float GetDirLightIntensity();                                                                                            // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetDirLightColor
	// FLinearColor GetDirLightColor();                                                                                         // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetSkyLightIntensity
	// float GetSkyLightIntensity();                                                                                            // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.GetSkyLightColor
	// FLinearColor GetSkyLightColor();                                                                                         // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.ResetOverwriteParam
	// void ResetOverwriteParam();                                                                                              // [0x2fd44f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.Setup Overwrite Param
	// void SetupOverwriteParam(FMapEnvOverwriteParamSetupInfo& Param);                                                         // [0x2fd44f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateUseEnvParam
	// void UpdateUseEnvParam(EWeatherType nowWeather, bool shouldBeBlend);                                                     // [0x2fd44f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.CalcTimeRate
	// void CalcTimeRate(double skyGameTime);                                                                                   // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateFogParam
	// void UpdateFogParam();                                                                                                   // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdatePostParam
	// void UpdatePostParam();                                                                                                  // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateSkyLightParam
	// void UpdateSkyLightParam();                                                                                              // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateDirectionalLightParam
	// void UpdateDirectionalLightParam();                                                                                      // [0x2fd44f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateCommonParam
	// void UpdateCommonParam();                                                                                                // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UpdateEnvParams
	// void UpdateEnvParams(FMapEnvUpdateInfo& Param);                                                                          // [0x2fd44f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.OnSetup
	// void OnSetup(FMapEnvUpdateInfo& _param);                                                                                 // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.OnUpdate
	// void OnUpdate(FMapEnvUpdateInfo& _param);                                                                                // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.OnSetupOverwriteParam
	// void OnSetupOverwriteParam(FMapEnvOverwriteParamSetupInfo& _param);                                                      // [0x2fd44f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.OnResetOverwriteParam
	// void OnResetOverwriteParam();                                                                                            // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetSkyLightIntensity
	// void SetSkyLightIntensity(float _val);                                                                                   // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetSkyLightColor
	// void SetSkyLightColor(FLinearColor _color);                                                                              // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetDirLightColor
	// void SetDirLightColor(FLinearColor _color);                                                                              // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetDirLightIntensity
	// void SetDirLightIntensity(float _val);                                                                                   // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetHeightFogDensity
	// void SetHeightFogDensity(float _val);                                                                                    // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetHeightFogInscatteringColor
	// void SetHeightFogInscatteringColor(FLinearColor _color);                                                                 // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetHeightFogStartDistance
	// void SetHeightFogStartDistance(float _val);                                                                              // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetSkyParamGroundColor
	// void SetSkyParamGroundColor(FLinearColor _color);                                                                        // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetSkyParamSkyColor0
	// void SetSkyParamSkyColor0(FLinearColor _color);                                                                          // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetSkyParamSkyColor1
	// void SetSkyParamSkyColor1(FLinearColor _color);                                                                          // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetCommonParamSkinColor
	// void SetCommonParamSkinColor(FLinearColor _color);                                                                       // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetCommonParamSmokeColor
	// void SetCommonParamSmokeColor(FLinearColor _color);                                                                      // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetCommonParamWaterColor
	// void SetCommonParamWaterColor(FLinearColor _color);                                                                      // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetPostParamColorFilterBottom
	// void SetPostParamColorFilterBottom(FLinearColor _color);                                                                 // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetPostParamColorFilterTop
	// void SetPostParamColorFilterTop(FLinearColor _color);                                                                    // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetCommonParamEmissiveRate
	// void SetCommonParamEmissiveRate(float _val);                                                                             // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetDirLightRot
	// void SetDirLightRot(FRotator _rot);                                                                                      // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.SetHDRSceneColorMultiplier
	// void SetHDRSceneColorMultiplier(float _val);                                                                             // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Environment/Common/BP/BP_DynamicSky.BP_DynamicSky_C.ExecuteUbergraph_BP_DynamicSky
	// void ExecuteUbergraph_BP_DynamicSky(int32_t EntryPoint);                                                                 // [0x2fd44f0] Final|HasDefaults    
};

/// Class /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C
/// Size: 0x16DA (5850 bytes) (0x000AF0 - 0x0016DA) align 16 MaxSize: 0x16DA
class UAvatar_IdleRun_SubAnimBP_C : public UAvatarAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0AF0   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[20]; // 0x0AF8   (0x0014)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0B0C   (0x0004)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0B10   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0B18   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0B20   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0B40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0B68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0B90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0BB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0BE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x0C08   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0C30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x0C58   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x0C80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x0CA8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x0CD0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x0CF8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x0D20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0D48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0D70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0D98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0DC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x0DE8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0E10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0E58   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x0E78   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult18;                                // 0x0EC0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer19;                             // 0x0EE0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult20;                                // 0x0F28   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0F48   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult21;                                // 0x0FB8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer22;                             // 0x0FD8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult23;                                // 0x1020   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer24;                             // 0x1040   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult25;                                // 0x1088   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer26;                           // 0x10A8   (0x0070)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1118   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult27;                                // 0x1160   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1180   (0x00C8)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x1248   (0x0008)  MISSED
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x1250   (0x0440)  
	double                                             IdleTime;                                                   // 0x1690   (0x0008)  
	bool                                               CountStart;                                                 // 0x1698   (0x0001)  
	bool                                               IdleMotion;                                                 // 0x1699   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x169A   (0x0006)  MISSED
	TArray<class UAnimSequence*>                       WaitAnimSeqList;                                            // 0x16A0   (0x0010)  
	class UAnimSequence*                               CurrentIdleAction;                                          // 0x16B0   (0x0008)  
	bool                                               IsEnable;                                                   // 0x16B8   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x16B9   (0x0007)  MISSED
	FVector                                            actorPos;                                                   // 0x16C0   (0x0018)  
	ECharaWeaponMode                                   weaponState;                                                // 0x16D8   (0x0001)  
	bool                                               IsPlayingMontage;                                           // 0x16D9   (0x0001)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.000
	// void _0_0_0();                                                                                                           // [0x2fd44f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_52519F20424A561F86F2068691379F4C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_52519F20424A561F86F2068691379F4C(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_5C71D49448A890533F4BA983E27C770D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_5C71D49448A890533F4BA983E27C770D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_534E70D94FDFBCDFCF9ABB8DB1A3A667
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_534E70D94FDFBCDFCF9ABB8DB1A3A667(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_BB8258E9479F5AB3ED2B9784BC98A642
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_BB8258E9479F5AB3ED2B9784BC98A642(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_139776174CBBB0618F5159A5F49566AA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_139776174CBBB0618F5159A5F49566AA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_EF31C3EF41C1BD444D99B2BA9684A3E2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_EF31C3EF41C1BD444D99B2BA9684A3E2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_4D97565D4934C17418757798FE9C8EC4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_4D97565D4934C17418757798FE9C8EC4(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_24AD00A4492D14D3A6042A8F1735129A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_24AD00A4492D14D3A6042A8F1735129A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_27D14A48405C3F431D4E0383DBCC168D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_27D14A48405C3F431D4E0383DBCC168D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_8C57761C4B95F4E18884E38AB7F6A3B5
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_8C57761C4B95F4E18884E38AB7F6A3B5(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_8D8CEE6B442AA0CE75F5BBA27C2B54B1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_IdleRun_SubAnimBP_AnimGraphNode_TransitionResult_8D8CEE6B442AA0CE75F5BBA27C2B54B1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.AnimNotify_IdleStart
	// void AnimNotify_IdleStart();                                                                                             // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.AnimNotify_RemoveIdle
	// void AnimNotify_RemoveIdle();                                                                                            // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.00000
	// void _0_0_0_0_0();                                                                                                       // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_IdleRun_SubAnimBP.Avatar_IdleRun_SubAnimBP_C.ExecuteUbergraph_Avatar_IdleRun_SubAnimBP
	// void ExecuteUbergraph_Avatar_IdleRun_SubAnimBP(int32_t EntryPoint);                                                      // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/_AnimBP/Chara_LookIK.Chara_LookIK_C
/// Size: 0x0B79 (2937 bytes) (0x000368 - 0x000B79) align 16 MaxSize: 0x0B79
class UChara_LookIK_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[32]; // 0x0378   (0x0020)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0398   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x03A0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x03A8   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x03C8   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0410   (0x0028)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0438   (0x0020)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0458   (0x0008)  MISSED
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0460   (0x0250)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x06B0   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x06D0   (0x0080)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0750   (0x00B8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose0;                              // 0x0808   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose1;                               // 0x0888   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose2;                               // 0x08B0   (0x0028)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x08D8   (0x0008)  MISSED
	FAnimNode_LookAt                                   AnimGraphNode_LookAt3;                                      // 0x08E0   (0x0250)  
	FANIM_INSTANCE_LOOK_IK_PARAM                       LookIKParam;                                                // 0x0B30   (0x0048)  
	bool                                               UseLookIK;                                                  // 0x0B78   (0x0001)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/Chara_LookIK.Chara_LookIK_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/Chara_LookIK.Chara_LookIK_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chara_LookIK_AnimGraphNode_LookAt_DCE528994D61275D10D5BFBB525472E3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Chara_LookIK_AnimGraphNode_LookAt_DCE528994D61275D10D5BFBB525472E3();   // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/Chara_LookIK.Chara_LookIK_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/Chara_LookIK.Chara_LookIK_C.ExecuteUbergraph_Chara_LookIK
	// void ExecuteUbergraph_Chara_LookIK(int32_t EntryPoint);                                                                  // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C
/// Size: 0x6C92 (27794 bytes) (0x000AF0 - 0x006C92) align 16 MaxSize: 0x6C92
class UAvatar_AnimBP_C : public UAvatarAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0AF0   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[148]; // 0x0AF8   (0x0094)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0B8C   (0x0004)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0B90   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0B98   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0BA0   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0BC0   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0C40   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0C68   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0CB0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0CF8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0D18   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0DE0   (0x00F0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0ED0   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0F18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0F40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0F68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0F90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0FB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x0FE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x1008   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x1030   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x1058   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x1080   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x10A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x10D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x10F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x1120   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x1148   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x1170   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x1198   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x11C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult17;                           // 0x11E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult18;                           // 0x1210   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x1238   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x1260   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x1288   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult22;                           // 0x12B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult23;                           // 0x12D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x1300   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x1328   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer26;                             // 0x1350   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult27;                                // 0x1398   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer28;                             // 0x13B8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult29;                                // 0x1400   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1420   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult30;                                // 0x1490   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer31;                             // 0x14B0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult32;                                // 0x14F8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer33;                             // 0x1518   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult34;                                // 0x1560   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x1580   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult36;                                // 0x15C8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer37;                             // 0x15E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult38;                                // 0x1630   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x1650   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1698   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer41;                             // 0x16B8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult42;                                // 0x1700   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer43;                             // 0x1720   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult44;                                // 0x1768   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer45;                           // 0x1788   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool46;                            // 0x17F8   (0x0048)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x1840   (0x00B8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult47;                                // 0x18F8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine48;                               // 0x1918   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult49;                           // 0x19E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult50;                           // 0x1A08   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult51;                           // 0x1A30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult52;                           // 0x1A58   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult53;                           // 0x1A80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult54;                           // 0x1AA8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult55;                           // 0x1AD0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult56;                           // 0x1AF8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult57;                           // 0x1B20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult58;                           // 0x1B48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult59;                           // 0x1B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult60;                           // 0x1B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult61;                           // 0x1BC0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer62;                             // 0x1BE8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult63;                                // 0x1C30   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer64;                             // 0x1C50   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult65;                                // 0x1C98   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer66;                             // 0x1CB8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult67;                                // 0x1D00   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer68;                             // 0x1D20   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult69;                                // 0x1D68   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer70;                             // 0x1D88   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult71;                                // 0x1DD0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer72;                             // 0x1DF0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult73;                                // 0x1E38   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer74;                           // 0x1E58   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool75;                            // 0x1EC8   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer76;                           // 0x1F10   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult77;                                // 0x1F80   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine78;                               // 0x1FA0   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum79;                            // 0x2068   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult80;                           // 0x20B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult81;                           // 0x20D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult82;                           // 0x2100   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult83;                           // 0x2128   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult84;                           // 0x2150   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x2178   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult86;                           // 0x21A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult87;                           // 0x21C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult88;                           // 0x21F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult89;                           // 0x2218   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult90;                           // 0x2240   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult91;                           // 0x2268   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult92;                           // 0x2290   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult93;                           // 0x22B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult94;                           // 0x22E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult95;                           // 0x2308   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer96;                             // 0x2330   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult97;                                // 0x2378   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer98;                             // 0x2398   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult99;                                // 0x23E0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer100;                            // 0x2400   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult101;                               // 0x2448   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer102;                            // 0x2468   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult103;                               // 0x24B0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer104;                            // 0x24D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult105;                               // 0x2518   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer106;                            // 0x2538   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult107;                               // 0x2580   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer108;                            // 0x25A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult109;                               // 0x25E8   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer110;                          // 0x2608   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool111;                           // 0x2678   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer112;                          // 0x26C0   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult113;                               // 0x2730   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine114;                              // 0x2750   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult115;                          // 0x2818   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult116;                          // 0x2840   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult117;                          // 0x2868   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult118;                          // 0x2890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult119;                          // 0x28B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult120;                          // 0x28E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult121;                          // 0x2908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult122;                          // 0x2930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult123;                          // 0x2958   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult124;                          // 0x2980   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult125;                          // 0x29A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult126;                          // 0x29D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult127;                          // 0x29F8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer128;                            // 0x2A20   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult129;                               // 0x2A68   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer130;                            // 0x2A88   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult131;                               // 0x2AD0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer132;                            // 0x2AF0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult133;                               // 0x2B38   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer134;                            // 0x2B58   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult135;                               // 0x2BA0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer136;                            // 0x2BC0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult137;                               // 0x2C08   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer138;                            // 0x2C28   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult139;                               // 0x2C70   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer140;                          // 0x2C90   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool141;                           // 0x2D00   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer142;                          // 0x2D48   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult143;                               // 0x2DB8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine144;                              // 0x2DD8   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult145;                          // 0x2EA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult146;                          // 0x2EC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult147;                          // 0x2EF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult148;                          // 0x2F18   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer149;                            // 0x2F40   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult150;                               // 0x2F88   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer151;                            // 0x2FA8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult152;                               // 0x2FF0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer153;                            // 0x3010   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult154;                               // 0x3058   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer155;                            // 0x3078   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult156;                               // 0x30C0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine157;                              // 0x30E0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer158;                            // 0x31A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult159;                               // 0x31F0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine160;                              // 0x3210   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer161;                            // 0x32D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult162;                               // 0x3320   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine163;                              // 0x3340   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose164;                            // 0x3408   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose165;                             // 0x3488   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose166;                             // 0x34B0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose167;                             // 0x34D8   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend168;                          // 0x3500   (0x00F0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool169;                           // 0x35F0   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose170;                             // 0x3638   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose171;                             // 0x3660   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x3688   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose172;                            // 0x36D0   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose173;                             // 0x3750   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult174;                          // 0x3778   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult175;                          // 0x37A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult176;                          // 0x37C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult177;                          // 0x37F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult178;                          // 0x3818   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult179;                          // 0x3840   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult180;                          // 0x3868   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult181;                          // 0x3890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult182;                          // 0x38B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult183;                          // 0x38E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult184;                          // 0x3908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult185;                          // 0x3930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult186;                          // 0x3958   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer187;                            // 0x3980   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult188;                               // 0x39C8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer189;                            // 0x39E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult190;                               // 0x3A30   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer191;                            // 0x3A50   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult192;                               // 0x3A98   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer193;                            // 0x3AB8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult194;                               // 0x3B00   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer195;                            // 0x3B20   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult196;                               // 0x3B68   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer197;                            // 0x3B88   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult198;                               // 0x3BD0   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer199;                          // 0x3BF0   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool200;                           // 0x3C60   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer201;                          // 0x3CA8   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult202;                               // 0x3D18   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine203;                              // 0x3D38   (0x00C8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph204;                           // 0x3E00   (0x00B8)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x3EB8   (0x0008)  MISSED
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x3EC0   (0x0440)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer205;                            // 0x4300   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult206;                               // 0x4348   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine207;                              // 0x4368   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer208;                          // 0x4430   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult209;                               // 0x44A0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine210;                              // 0x44C0   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool211;                           // 0x4588   (0x0048)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph212;                           // 0x45D0   (0x00B8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose213;                            // 0x4688   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose214;                             // 0x4708   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose215;                             // 0x4730   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult216;                          // 0x4758   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult217;                          // 0x4780   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult218;                          // 0x47A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult219;                          // 0x47D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult220;                          // 0x47F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult221;                          // 0x4820   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult222;                          // 0x4848   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult223;                          // 0x4870   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult224;                          // 0x4898   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult225;                          // 0x48C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult226;                          // 0x48E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult227;                          // 0x4910   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult228;                          // 0x4938   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer229;                            // 0x4960   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult230;                               // 0x49A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer231;                            // 0x49C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult232;                               // 0x4A10   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer233;                            // 0x4A30   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult234;                               // 0x4A78   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer235;                            // 0x4A98   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult236;                               // 0x4AE0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer237;                            // 0x4B00   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult238;                               // 0x4B48   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer239;                            // 0x4B68   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult240;                               // 0x4BB0   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer241;                          // 0x4BD0   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool242;                           // 0x4C40   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer243;                          // 0x4C88   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult244;                               // 0x4CF8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine245;                              // 0x4D18   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer246;                            // 0x4DE0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool247;                           // 0x4E28   (0x0048)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph248;                           // 0x4E70   (0x00B8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose249;                            // 0x4F28   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose250;                             // 0x4FA8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer251;                            // 0x4FD0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer252;                            // 0x5018   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool253;                           // 0x5060   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend254;                          // 0x50A8   (0x00F0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer255;                          // 0x5198   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult256;                               // 0x5208   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine257;                              // 0x5228   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose258;                            // 0x52F0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer259;                            // 0x5370   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer260;                            // 0x53B8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer261;                            // 0x5400   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer262;                            // 0x5448   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer263;                            // 0x5490   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer264;                            // 0x54D8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer265;                            // 0x5520   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer266;                            // 0x5568   (0x0048)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum267;                           // 0x55B0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer268;                            // 0x55F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult269;                               // 0x5640   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine270;                              // 0x5660   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose271;                             // 0x5728   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose272;                             // 0x5750   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose273;                             // 0x5778   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer274;                            // 0x57A0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer275;                            // 0x57E8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer276;                            // 0x5830   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer277;                            // 0x5878   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer278;                            // 0x58C0   (0x0048)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum279;                           // 0x5908   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult280;                               // 0x5950   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine281;                              // 0x5970   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend282;                          // 0x5A38   (0x00F0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose283;                            // 0x5B28   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool284;                           // 0x5BA8   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose285;                             // 0x5BF0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose286;                             // 0x5C18   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose287;                            // 0x5C40   (0x0080)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose288;                            // 0x5CC0   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose289;                             // 0x5D40   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose290;                             // 0x5D68   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend291;                          // 0x5D90   (0x00F0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose292;                            // 0x5E80   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose293;                             // 0x5F00   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose294;                             // 0x5F28   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool295;                           // 0x5F50   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose296;                             // 0x5F98   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot297;                                      // 0x5FC0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool298;                           // 0x6008   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool299;                           // 0x6050   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose300;                             // 0x6098   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool301;                           // 0x60C0   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult302;                          // 0x6108   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult303;                          // 0x6130   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult304;                          // 0x6158   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult305;                          // 0x6180   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult306;                          // 0x61A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult307;                          // 0x61D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult308;                          // 0x61F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult309;                          // 0x6220   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer310;                            // 0x6248   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult311;                               // 0x6290   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer312;                            // 0x62B0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult313;                               // 0x62F8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer314;                            // 0x6318   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult315;                               // 0x6360   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer316;                            // 0x6380   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult317;                               // 0x63C8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer318;                            // 0x63E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult319;                               // 0x6430   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer320;                          // 0x6450   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult321;                               // 0x64C0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine322;                              // 0x64E0   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend323;                          // 0x65A8   (0x00F0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose324;                             // 0x6698   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult325;                          // 0x66C0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer326;                            // 0x66E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult327;                               // 0x6730   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer328;                            // 0x6750   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult329;                               // 0x6798   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine330;                              // 0x67B8   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose331;                            // 0x6880   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose332;                             // 0x6900   (0x0028)  
	float                                              K2Node_PropertyAccess;                                      // 0x6928   (0x0004)  
	float                                              K2Node_PropertyAccess333;                                   // 0x692C   (0x0004)  
	float                                              K2Node_PropertyAccess334;                                   // 0x6930   (0x0004)  
	float                                              K2Node_PropertyAccess335;                                   // 0x6934   (0x0004)  
	float                                              K2Node_PropertyAccess336;                                   // 0x6938   (0x0004)  
	float                                              K2Node_PropertyAccess337;                                   // 0x693C   (0x0004)  
	float                                              K2Node_PropertyAccess338;                                   // 0x6940   (0x0004)  
	float                                              K2Node_PropertyAccess339;                                   // 0x6944   (0x0004)  
	float                                              K2Node_PropertyAccess340;                                   // 0x6948   (0x0004)  
	float                                              K2Node_PropertyAccess341;                                   // 0x694C   (0x0004)  
	float                                              K2Node_PropertyAccess342;                                   // 0x6950   (0x0004)  
	float                                              K2Node_PropertyAccess343;                                   // 0x6954   (0x0004)  
	bool                                               __CustomProperty_m_isHoldAttackModel_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6958   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x6959   (0x0003)  MISSED
	float                                              __CustomProperty_VehicleLeansMultiply_3ED42D6E469D02BA17DE4B88A762E78D; // 0x695C   (0x0004)  
	bool                                               __CustomProperty_m_isRideVehicle_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6960   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x6961   (0x0007)  MISSED
	class UAnimSequenceBase*                           __CustomProperty_Current_AnimSeq_jump02_O_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6968   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_Current_AnimSeq_jump02_L_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6970   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_Current_AnimSeq_jump01_O_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6978   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_Current_AnimSeq_jump01_L_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6980   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_Current_AnimSeq_jump01_I_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6988   (0x0008)  
	class UBlendSpace*                                 __CustomProperty_Current_IdleRun_Rider_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6990   (0x0008)  
	bool                                               __CustomProperty_isTiltAlignment_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6998   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x6999   (0x0007)  MISSED
	FVector                                            __CustomProperty_PrePos_3ED42D6E469D02BA17DE4B88A762E78D;   // 0x69A0   (0x0018)  
	float                                              __CustomProperty_Speed_3ED42D6E469D02BA17DE4B88A762E78D;    // 0x69B8   (0x0004)  
	bool                                               __CustomProperty_m_isAnimMontageOnlySpineUp_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69BC   (0x0001)  
	bool                                               __CustomProperty_m_isSheatheSwordStrafe_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69BD   (0x0001)  
	bool                                               __CustomProperty_m_isTargeting_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69BE   (0x0001)  
	bool                                               __CustomProperty_m_isHeadBanging_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69BF   (0x0001)  
	class UBlendSpace*                                 __CustomProperty_Current_IdleRun_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69C0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_CurrentMoveREnd_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69C8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_CurrentMoveLEnd_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69D0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_CurrentMoveStartRun_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69D8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_CurrentMoveStart_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69E0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_moveJump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69E8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_moveJump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69F0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_moveJump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x69F8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_moveJump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A00   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_moveJump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A08   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_jump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A10   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_jump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A18   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_jump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A20   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_jump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A28   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b04_jump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A30   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_moveJump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A38   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_moveJump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A40   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_moveJump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A48   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_moveJump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A50   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_moveJump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A58   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_jump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A60   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_jump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A68   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_jump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A70   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_jump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A78   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b03_jump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A80   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_moveJump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A88   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_moveJump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A90   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_moveJump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6A98   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_moveJump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AA0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_moveJump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AA8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_jump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AB0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_jump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AB8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_jump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AC0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_jump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AC8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b02_jump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AD0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_moveJump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AD8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_moveJump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AE0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_moveJump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AE8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_moveJump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AF0   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_moveJump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6AF8   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_jump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B00   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_jump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B08   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_jump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B10   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_jump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B18   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b01_jump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B20   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_moveJump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B28   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_moveJump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B30   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_moveJump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B38   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_moveJump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B40   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_moveJump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B48   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_jump02_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B50   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_jump02_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B58   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_jump01_O_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B60   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_jump01_L_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B68   (0x0008)  
	class UAnimSequenceBase*                           __CustomProperty_AnimSeq_b00_jump01_I_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B70   (0x0008)  
	bool                                               __CustomProperty_IsPlayingMontage_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B78   (0x0001)  
	ECharaWeaponMode                                   __CustomProperty_weaponState_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B79   (0x0001)  
	bool                                               __CustomProperty_IsEnable_3ED42D6E469D02BA17DE4B88A762E78D; // 0x6B7A   (0x0001)  
	unsigned char                                      UnknownData05_6[0x5];                                       // 0x6B7B   (0x0005)  MISSED
	FBoneSizeInfoList                                  __CustomProperty_Bone_Size_Info_List_3ACDCD2D45DA9BA08D23429D7746C135; // 0x6B80   (0x0010)  
	TMap<FName, FBoneSizeInfo>                         __CustomProperty_BoneInfo_3ACDCD2D45DA9BA08D23429D7746C135; // 0x6B90   (0x0050)  
	bool                                               __CustomProperty_UseLookIK_DE1A464E426ADD2E5A67D5929EF7D4DA; // 0x6BE0   (0x0001)  
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x6BE1   (0x0007)  MISSED
	FANIM_INSTANCE_LOOK_IK_PARAM                       __CustomProperty_LookIKParam_DE1A464E426ADD2E5A67D5929EF7D4DA; // 0x6BE8   (0x0048)  
	bool                                               __CustomProperty_UseLookIK_D4ECE1BE4DD12D95AFD654AAEB0C7001; // 0x6C30   (0x0001)  
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x6C31   (0x0007)  MISSED
	FANIM_INSTANCE_LOOK_IK_PARAM                       __CustomProperty_LookIKParam_D4ECE1BE4DD12D95AFD654AAEB0C7001; // 0x6C38   (0x0048)  
	class UBlendSpace*                                 Rpg_Default_Idle_Run_;                                      // 0x6C80   (0x0008)  
	double                                             FallingTimer;                                               // 0x6C88   (0x0008)  
	bool                                               IsFalling;                                                  // 0x6C90   (0x0001)  
	ECharaGameMode                                     C;                                                          // 0x6C91   (0x0001)  


	/// Functions
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_8A0537DA46466BF6F60468A3A66B6A4E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_8A0537DA46466BF6F60468A3A66B6A4E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_63CA6AA64C2B7C0E2F0176BDE2726EFA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_63CA6AA64C2B7C0E2F0176BDE2726EFA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_CB4A2FD0443A5C0DDF256E8D352C56E4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_CB4A2FD0443A5C0DDF256E8D352C56E4(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_D15EF4174F81DF26250CB2B647014F95
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_D15EF4174F81DF26250CB2B647014F95(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_54BC8076443D2BEC49B077BC364A083F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_54BC8076443D2BEC49B077BC364A083F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_940033554811E738A9BCA2A050F9ADB7
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_940033554811E738A9BCA2A050F9ADB7(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_232E5BD34CC139CA8C7F93B93F0CD42C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_232E5BD34CC139CA8C7F93B93F0CD42C(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_698ACA2E4BEC8A9F869872993A3EC602
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_698ACA2E4BEC8A9F869872993A3EC602(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E43D0F4E42481264EA5899B3772EAF08
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E43D0F4E42481264EA5899B3772EAF08(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_4B1FB52D4D84B088B3F4E696B28FB428
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_4B1FB52D4D84B088B3F4E696B28FB428(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2301A0174E5DF5030A051F9B656A3FE1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2301A0174E5DF5030A051F9B656A3FE1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_20D2C0DA4A4997132F7A7F9DA381F251
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_BlendListByBool_20D2C0DA4A4997132F7A7F9DA381F251(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_FF1773A14BF3239DD1010EA8DB00A40D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_FF1773A14BF3239DD1010EA8DB00A40D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2BA857704F173E7AA401418C23B7878E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2BA857704F173E7AA401418C23B7878E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EAF55B8140E4C4683AD17B91DFF9AADA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EAF55B8140E4C4683AD17B91DFF9AADA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_95F9E8CD4DAE9DF75B8C609E6353FDBA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_95F9E8CD4DAE9DF75B8C609E6353FDBA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_66AF2EBE472A45A809053DB39084E0A5
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_66AF2EBE472A45A809053DB39084E0A5(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_F41BA18E497A59DF77F9948337573AE2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_F41BA18E497A59DF77F9948337573AE2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_FB87E65448333D16FA93EAA5BCEA1179
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_FB87E65448333D16FA93EAA5BCEA1179(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_1A7F5BA94D91C6E59A98D19A041B9E4F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_1A7F5BA94D91C6E59A98D19A041B9E4F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_254E01F948479B3B82CB6C94E91B3FFA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_254E01F948479B3B82CB6C94E91B3FFA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EA1E543C4B51C1C7FE776F9E0AF5BBC2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EA1E543C4B51C1C7FE776F9E0AF5BBC2(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_296CC5F14B7195D20541F3B40C7745BB
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_296CC5F14B7195D20541F3B40C7745BB(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_16D9FC2549F0BE0F8B32FC990813CADE
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_16D9FC2549F0BE0F8B32FC990813CADE(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_916F63EE4C211CB79FFD4886F6444576
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_916F63EE4C211CB79FFD4886F6444576(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E6CE673B4082E6C7EC77629D78F8D792
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E6CE673B4082E6C7EC77629D78F8D792(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_58C52200486CD8405EE8EEB9C6A3E044
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_58C52200486CD8405EE8EEB9C6A3E044(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_BA8C0B394ED05885854A9CB4E2D20664
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_BA8C0B394ED05885854A9CB4E2D20664(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_23B0A3CF4C842EF53030E5B3482A252E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_23B0A3CF4C842EF53030E5B3482A252E(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D7328E284CAADDEFFF0F7FBE72400A6B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D7328E284CAADDEFFF0F7FBE72400A6B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_3C08C16549080A013E5F2397D2B994CE
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_3C08C16549080A013E5F2397D2B994CE(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_0FD550F5437701E01F264C935C8795F3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_0FD550F5437701E01F264C935C8795F3(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_A1E8F8AC440377F80DE2CA81BA50B393
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_A1E8F8AC440377F80DE2CA81BA50B393(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D3FC3D4042491093E390349BE8374E9C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D3FC3D4042491093E390349BE8374E9C(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2116ACF64B530A0D7022208A346BCD26
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2116ACF64B530A0D7022208A346BCD26(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EEDE28CB40E5D13BEAA55B9600C51962
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_EEDE28CB40E5D13BEAA55B9600C51962(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_A678CE944D7F28AF15E359B61FE5B4CD
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_A678CE944D7F28AF15E359B61FE5B4CD(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_42B772CC4E1DB259D7A1F8A8F3083C8A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_42B772CC4E1DB259D7A1F8A8F3083C8A(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D12331D04DE6121AB750ECABE42EC348
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_D12331D04DE6121AB750ECABE42EC348(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_814CD77C4ACC26ABE63EF2A9A31B6300
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_814CD77C4ACC26ABE63EF2A9A31B6300(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_09D69E3D43358879DA2F5DBE37F0AFF6
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_09D69E3D43358879DA2F5DBE37F0AFF6(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_B45E8360490DB8223943DD85E2124B68
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_B45E8360490DB8223943DD85E2124B68(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_993FABB14C050754C4E6CE8335969893
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_993FABB14C050754C4E6CE8335969893(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_21C7A02B4805B638F1B348BDA0145397
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_21C7A02B4805B638F1B348BDA0145397(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_B63ADF4B4EB919456433568904669377
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_B63ADF4B4EB919456433568904669377(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_AE4B72DA465A865C366D64802841CEC0
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_AE4B72DA465A865C366D64802841CEC0(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2F67FDC44EE489F20F8C699CF5253084
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_2F67FDC44EE489F20F8C699CF5253084(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E4EF82394BA370AD4E026E92F6AFEDD4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E4EF82394BA370AD4E026E92F6AFEDD4(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_LinkedAnimGraph_3ED42D6E469D02BA17DE4B88A762E78D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_LinkedAnimGraph_3ED42D6E469D02BA17DE4B88A762E78D(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_790E65E0497E3DACA2C6B388A33D2340
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_790E65E0497E3DACA2C6B388A33D2340(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_48F3569B4AD5213D9A92E0BA618786AC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_48F3569B4AD5213D9A92E0BA618786AC(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_503F7565453A4857F714A583B9AD5EBA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_503F7565453A4857F714A583B9AD5EBA(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_7FEB0E604061F6E4A5BF59A1F8D8A267
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_7FEB0E604061F6E4A5BF59A1F8D8A267(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_0F4DECFB46BD361C90F2429AFB16B91F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_0F4DECFB46BD361C90F2429AFB16B91F(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_F75F6CC74B356FDAF0EE9FB971D1DC4C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_F75F6CC74B356FDAF0EE9FB971D1DC4C(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E8C37EF64F710BBCED7A03B14F8A1378
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_E8C37EF64F710BBCED7A03B14F8A1378(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_DB92BEBB4FA7CA5C1815DC81B5E5692B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_DB92BEBB4FA7CA5C1815DC81B5E5692B(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.BPEvent_SetCurrentMoveStart
	// void BPEvent_SetCurrentMoveStart(EMoveStartAngleType _angleType);                                                        // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.BPEvent_SetCurrentMoveEnd
	// void BPEvent_SetCurrentMoveEnd(EMoveStartSpeedType _speedType);                                                          // [0x2fd44f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_762FC988482FAB301909C6BB22E6BFF1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Avatar_AnimBP_AnimGraphNode_TransitionResult_762FC988482FAB301909C6BB22E6BFF1(); // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.AnimNotify_JumpStateLeave
	// void AnimNotify_JumpStateLeave();                                                                                        // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.BlueprintBeginPlay
	// void BlueprintBeginPlay();                                                                                               // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.AnimNotify_LandingStateLeave
	// void AnimNotify_LandingStateLeave();                                                                                     // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.AnimNotify_StartFalling
	// void AnimNotify_StartFalling();                                                                                          // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.AnimNotify_EndFalling
	// void AnimNotify_EndFalling();                                                                                            // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/_AnimBP/avt000000/Avatar_AnimBP.Avatar_AnimBP_C.ExecuteUbergraph_Avatar_AnimBP
	// void ExecuteUbergraph_Avatar_AnimBP(int32_t EntryPoint);                                                                 // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Object/obj0b0000/00/BP_AlwaysGate.BP_AlwaysGate_C
/// Size: 0x0FE8 (4072 bytes) (0x000FE8 - 0x000FE8) align 16 MaxSize: 0x0FE8
class ABP_AlwaysGate_C : public ABP_ScnCharacter_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj070000/00/BP_obj070000_00.BP_obj070000_00_C
/// Size: 0x03F0 (1008 bytes) (0x000368 - 0x0003F0) align 16 MaxSize: 0x03F0
class UBP_obj070000_00_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0368   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x03A8   (0x0048)  


	/// Functions
	// Function /Game/Graphics/3D/Object/obj070000/00/BP_obj070000_00.BP_obj070000_00_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2fd44f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Object/obj070000/00/BP_obj070000_00.BP_obj070000_00_C.ExecuteUbergraph_BP_obj070000_00
	// void ExecuteUbergraph_BP_obj070000_00(int32_t EntryPoint);                                                               // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Object/obj0c0003/00/BP_HonegonShadowActor.BP_HonegonShadowActor_C
/// Size: 0x1038 (4152 bytes) (0x000FE8 - 0x001038) align 16 MaxSize: 0x1038
class ABP_HonegonShadowActor_C : public ABP_ScnCharacter_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	class UDecalComponent*                             Decal;                                                      // 0x0FF0   (0x0008)  
	class UDecalComponent*                             DecalComponent;                                             // 0x0FF8   (0x0008)  
	class AScnCharaActor*                              PlayerActor;                                                // 0x1000   (0x0008)  
	FVector                                            goalPos;                                                    // 0x1008   (0x0018)  
	double                                             speedVelocity;                                              // 0x1020   (0x0008)  
	TArray<FName>                                      Key;                                                        // 0x1028   (0x0010)  


	/// Functions
	// Function /Game/Graphics/3D/Object/obj0c0003/00/BP_HonegonShadowActor.BP_HonegonShadowActor_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Object/obj0c0003/00/BP_HonegonShadowActor.BP_HonegonShadowActor_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Object/obj0c0003/00/BP_HonegonShadowActor.BP_HonegonShadowActor_C.ExecuteUbergraph_BP_HonegonShadowActor
	// void ExecuteUbergraph_BP_HonegonShadowActor(int32_t EntryPoint);                                                         // [0x2fd44f0] Final|HasDefaults    
};

/// Class /Game/Graphics/3D/Object/obj0b0000/00/BP_AlwaysGateInner.BP_AlwaysGateInner_C
/// Size: 0x0FE8 (4072 bytes) (0x000FE8 - 0x000FE8) align 16 MaxSize: 0x0FE8
class ABP_AlwaysGateInner_C : public ABP_ScnCharacter_C
{ 
public:
};

/// Class /Game/Graphics/3D/Event/ev90_03601/BP_mdl_shrine_event_startpoint_light_off.BP_mdl_shrine_event_startpoint_light_off_C
/// Size: 0x02F8 (760 bytes) (0x0002DC - 0x0002F8) align 8 MaxSize: 0x02F8
class ABP_mdl_shrine_event_startpoint_light_off_C : public ABP_MapActor_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x02DC   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	float                                              _________Track_1_5A5952FC444F667F3896AC8D5D0C48B0;          // 0x02E8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ________Direction_5A5952FC444F667F3896AC8D5D0C48B0;         // 0x02EC   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x02ED   (0x0003)  MISSED
	class UTimelineComponent*                          _0_0_0;                                                     // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Event/ev90_03601/BP_mdl_shrine_event_startpoint_light_off.BP_mdl_shrine_event_startpoint_light_off_C.000000_
	// void _0_0_0_0_0_0_();                                                                                                    // [0x2fd44f0] BlueprintEvent       
	// Function /Game/Graphics/3D/Event/ev90_03601/BP_mdl_shrine_event_startpoint_light_off.BP_mdl_shrine_event_startpoint_light_off_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Event/ev90_03601/BP_mdl_shrine_event_startpoint_light_off.BP_mdl_shrine_event_startpoint_light_off_C.ExecuteUbergraph_BP_mdl_shrine_event_startpoint_light_off
	// void ExecuteUbergraph_BP_mdl_shrine_event_startpoint_light_off(int32_t EntryPoint);                                      // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Object/obj000180/00/BP_mdl_obj000180_00.BP_mdl_obj000180_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000180_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Craft/cft000200/00/BP_mdl_cft000200_02.BP_mdl_cft000200_02_C
/// Size: 0x02F0 (752 bytes) (0x0002F0 - 0x0002F0) align 8 MaxSize: 0x02F0
class ABP_mdl_cft000200_02_C : public ABP_MapInteractionGrassActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Craft/cft000200/00/BP_mdl_cft000200_00.BP_mdl_cft000200_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_cft000200_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000110/00/BP_mdl_obj000110_00.BP_mdl_obj000110_00_C
/// Size: 0x02F0 (752 bytes) (0x0002F0 - 0x0002F0) align 8 MaxSize: 0x02F0
class ABP_mdl_obj000110_00_C : public ABP_MapInteractionGrassActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000109/00/BP_mdl_obj000109_00.BP_mdl_obj000109_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000109_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000202/00/BP_mdl_obj000202_00.BP_mdl_obj000202_00_C
/// Size: 0x02E8 (744 bytes) (0x0002E8 - 0x0002E8) align 8 MaxSize: 0x02E8
class ABP_mdl_obj000202_00_C : public ABP_MapPillarActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000200/00/Mdl/BP_mdl_obj000200_00.BP_mdl_obj000200_00_C
/// Size: 0x02E8 (744 bytes) (0x0002E8 - 0x0002E8) align 8 MaxSize: 0x02E8
class ABP_mdl_obj000200_00_C : public ABP_MapPillarActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000108/00/BP_mdl_obj000108_00.BP_mdl_obj000108_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000108_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000102/00/BP_mdl_obj000102_00.BP_mdl_obj000102_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000102_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000100/00/BP_mdl_obj000100_01.BP_mdl_obj000100_01_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000100_01_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000100/00/BP_mdl_obj000100_00.BP_mdl_obj000100_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000100_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000100/00/BP_mdl_obj000100_02.BP_mdl_obj000100_02_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000100_02_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000106/00/BP_mdl_obj000106_00.BP_mdl_obj000106_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000106_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000106/00/BP_mdl_obj000106_01.BP_mdl_obj000106_01_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000106_01_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000130/00/BP_mdl_obj000130_00.BP_mdl_obj000130_00_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000130_00_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj000130/00/BP_mdl_obj000130_03.BP_mdl_obj000130_03_C
/// Size: 0x02DC (732 bytes) (0x0002DC - 0x0002DC) align 8 MaxSize: 0x02DC
class ABP_mdl_obj000130_03_C : public ABP_MapActor_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100_02.BP_eff_cmn_000100_02_C
/// Size: 0x0420 (1056 bytes) (0x000401 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000100_02_C : public ABP_EffectBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0401   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0408   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0410   (0x0008)  
	double                                             DestroyTime;                                                // 0x0418   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100_02.BP_eff_cmn_000100_02_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100_02.BP_eff_cmn_000100_02_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100_02.BP_eff_cmn_000100_02_C.ExecuteUbergraph_BP_eff_cmn_000100_02
	// void ExecuteUbergraph_BP_eff_cmn_000100_02(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_12_C
/// Size: 0x0420 (1056 bytes) (0x000401 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000100_12_C : public ABP_EffectBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0401   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0408   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0410   (0x0008)  
	double                                             DestroyTime;                                                // 0x0418   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_12_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_12_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_12_C.ExecuteUbergraph_BP_eff_cmn_000100
	// void ExecuteUbergraph_BP_eff_cmn_000100(int32_t EntryPoint);                                                             // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000022_00/eff_b00_000022_00_AnimBP.eff_b00_000022_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000022_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000011_00/eff_b01_000011_00_AnimBP.eff_b01_000011_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000011_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_6/eff_b04_000020_04_6_AnimBP.eff_b04_000020_04_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_00/eff_w06_50_00_AnimBP.eff_w06_50_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000043_00/eff_b01_000043_00_AnimBP.eff_b01_000043_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000043_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_3/eff_b03_000010_02_3_AnimBP.eff_b03_000010_02_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d10001_00/eff_cmn_d10001_00_AnimBP.eff_cmn_d10001_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d10001_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000040_03/eff_b03_000040_03_AnimBP.eff_b03_000040_03_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000040_03_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000022_00/eff_b01_000022_00_AnimBP.eff_b01_000022_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000022_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000050_00/eff_b04_000050_00_AnimBP.eff_b04_000050_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000050_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_2/eff_b01_000070_00_2_AnimBP.eff_b01_000070_00_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000006_00/eff_b02_000006_00_AnimBP.eff_b02_000006_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000006_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_3/eff_b04_000020_04_3_AnimBP.eff_b04_000020_04_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d12000_00/eff_cmn_d12000_00_AnimBP.eff_cmn_d12000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d12000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_10/eff_w06_50_10_AnimBP.eff_w06_50_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_3/eff_b03_000010_00_3_AnimBP.eff_b03_000010_00_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000092_01/eff_b04_000092_01_AnimBP.eff_b04_000092_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000092_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000091_01/eff_b04_000091_01_AnimBP.eff_b04_000091_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000091_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000040_20/eff_b04_000040_20_AnimBP.eff_b04_000040_20_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000040_20_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000012_02/eff_b03_000012_02_AnimBP.eff_b03_000012_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000012_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000040_02/eff_b03_000040_02_AnimBP.eff_b03_000040_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000040_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000011_02/eff_b03_000011_02_AnimBP.eff_b03_000011_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000011_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_5/eff_b04_000020_04_5_AnimBP.eff_b04_000020_04_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000022_12/eff_b03_000022_12_AnimBP.eff_b03_000022_12_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000022_12_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000023_00/eff_b01_000023_00_AnimBP.eff_b01_000023_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000023_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000012_00/eff_b01_000012_00_AnimBP.eff_b01_000012_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000012_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_4/eff_b03_000010_02_4_AnimBP.eff_b03_000010_02_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000050_20/eff_b04_000050_20_AnimBP.eff_b04_000050_20_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000050_20_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_4/eff_b03_000020_12_4_AnimBP.eff_b03_000020_12_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_3/eff_b03_000020_12_3_AnimBP.eff_b03_000020_12_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000085_01/eff_b04_000085_01_AnimBP.eff_b04_000085_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000085_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_11/eff_w06_50_11_AnimBP.eff_w06_50_11_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_11_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000044_00/eff_b01_000044_00_AnimBP.eff_b01_000044_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000044_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000051_01/eff_cmn_000051_01_AnimBP.eff_cmn_000051_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_000051_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_6/eff_b03_000000_00_6_AnimBP.eff_b03_000000_00_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50/eff_b04_000000_50_AnimBP.eff_b04_000000_50_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_03/eff_w06_50_03_AnimBP.eff_w06_50_03_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_03_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_b00000_00/eff_cmn_b00000_00_AnimBP.eff_cmn_b00000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_b00000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000050_00/eff_cmn_000050_00_AnimBP.eff_cmn_000050_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_000050_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_1/eff_b03_000020_12_1_AnimBP.eff_b03_000020_12_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_5/eff_b03_000020_12_5_AnimBP.eff_b03_000020_12_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_2/eff_b03_000020_12_2_AnimBP.eff_b03_000020_12_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12/eff_b03_000020_12_AnimBP.eff_b03_000020_12_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_1/eff_b03_000010_00_1_AnimBP.eff_b03_000010_00_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000050_02/eff_b03_000050_02_AnimBP.eff_b03_000050_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000050_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_2/eff_b03_000010_02_2_AnimBP.eff_b03_000010_02_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_5/eff_b03_000010_02_5_AnimBP.eff_b03_000010_02_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_4/eff_b03_000010_00_4_AnimBP.eff_b03_000010_00_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_6/eff_b03_000010_00_6_AnimBP.eff_b03_000010_00_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000013_02/eff_b03_000013_02_AnimBP.eff_b03_000013_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000013_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_2/eff_b03_000010_00_2_AnimBP.eff_b03_000010_00_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_6/eff_b03_000010_02_6_AnimBP.eff_b03_000010_02_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00_5/eff_b03_000010_00_5_AnimBP.eff_b03_000010_00_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000013_00/eff_b03_000013_00_AnimBP.eff_b03_000013_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000013_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_4/eff_b01_000070_00_4_AnimBP.eff_b01_000070_00_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_4/eff_b04_000020_04_4_AnimBP.eff_b04_000020_04_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02/eff_b03_000010_02_AnimBP.eff_b03_000010_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_02_1/eff_b03_000010_02_1_AnimBP.eff_b03_000010_02_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_02_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000012_00/eff_b03_000012_00_AnimBP.eff_b03_000012_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000012_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000011_00/eff_b03_000011_00_AnimBP.eff_b03_000011_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000011_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000010_00/eff_b03_000010_00_AnimBP.eff_b03_000010_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000010_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d12006_00/eff_cmn_d12006_00_AnimbP.eff_cmn_d12006_00_AnimbP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d12006_00_AnimbP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000023_12/eff_b03_000023_12_AnimBP.eff_b03_000023_12_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000023_12_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000040_00/eff_b00_000040_00_AnimBP.eff_b00_000040_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000040_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_12_6/eff_b03_000020_12_6_AnimBP.eff_b03_000020_12_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_12_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000021_12/eff_b03_000021_12_AnimBP.eff_b03_000021_12_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000021_12_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000001_00/eff_b04_000001_00_AnimBP.eff_b04_000001_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000001_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00/eff_b03_000000_00_AnimBP.eff_b03_000000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000050_03/eff_b03_000050_03_AnimBP.eff_b03_000050_03_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000050_03_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000022_10/eff_b03_000022_10_AnimBP.eff_b03_000022_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000022_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_2/eff_b03_000000_00_2_AnimBP.eff_b03_000000_00_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_4/eff_b03_000000_00_4_AnimBP.eff_b03_000000_00_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10/eff_b03_000020_10_AnimBP.eff_b03_000020_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000003_00/eff_b04_000003_00_AnimBP.eff_b04_000003_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000003_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000004_00/eff_b04_000004_00_AnimBP.eff_b04_000004_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000004_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_5/eff_b03_000000_00_5_AnimBP.eff_b03_000000_00_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00/eff_b03_000001_00_AnimBP.eff_b03_000001_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_3/eff_b03_000020_10_3_AnimBP.eff_b03_000020_10_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_6/eff_b03_000020_10_6_AnimBP.eff_b03_000020_10_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_2/eff_b03_000020_10_2_AnimBP.eff_b03_000020_10_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000021_10/eff_b03_000021_10_AnimBP.eff_b03_000021_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000021_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_1/eff_b03_000000_00_1_AnimBP.eff_b03_000000_00_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000000_00_3/eff_b03_000000_00_3_AnimBP.eff_b03_000000_00_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000000_00_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000023_10/eff_b03_000023_10_AnimBP.eff_b03_000023_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000023_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000006_00/eff_b04_000006_00_AnimBP.eff_b04_000006_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000006_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_00/eff_b04_000000_00_AnimBP.eff_b04_000000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000002_00/eff_b04_000002_00_AnimBP.eff_b04_000002_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000002_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_1/eff_b03_000020_10_1_AnimBP.eff_b03_000020_10_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_5/eff_b03_000020_10_5_AnimBP.eff_b03_000020_10_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w05/_Unique/eff_w05_50_02/eff_w05_50_02_AnimBP.eff_w05_50_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w05_50_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000020_10_4/eff_b03_000020_10_4_AnimBP.eff_b03_000020_10_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000020_10_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d16000_00/eff_cmn_d16000_00_AnimBP.eff_cmn_d16000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d16000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000005_00/eff_b04_000005_00_AnimBP.eff_b04_000005_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000005_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000050_01/eff_cmn_000050_01_AnimBP.eff_cmn_000050_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_000050_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_1/eff_b03_000001_00_1_AnimBP.eff_b03_000001_00_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_2/eff_b04_000020_04_2_AnimBP.eff_b04_000020_04_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000026_00/eff_b02_000026_00_AnimBP.eff_b02_000026_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000026_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000025_00/eff_b00_000025_00_AnimBP.eff_b00_000025_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000025_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000020_00/eff_b00_000020_00_AnimBP.eff_b00_000020_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000020_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000016_00/eff_b01_000016_00_AnimBP.eff_b01_000016_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000016_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000045_00/eff_b01_000045_00_AnimBP.eff_b01_000045_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000045_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d00010_00/eff_cmn_d00010_00_AnimBP.eff_cmn_d00010_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d00010_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_13/eff_w06_50_13_AnimBP.eff_w06_50_13_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_13_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000030_00/eff_b04_000030_00_AnimBP.eff_b04_000030_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000030_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000051_00/eff_cmn_000051_00_AnimBP.eff_cmn_000051_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_000051_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000040_00/eff_b04_000040_00_AnimBP.eff_b04_000040_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000040_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_3/eff_b04_000000_50_3_AnimBP.eff_b04_000000_50_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000026_00/eff_b01_000026_00_AnimBP.eff_b01_000026_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000026_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000040_10/eff_b04_000040_10_AnimBP.eff_b04_000040_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000040_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_1/eff_b04_000000_50_1_AnimBP.eff_b04_000000_50_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000010_10/eff_b04_000010_10_AnimBP.eff_b04_000010_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000010_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000024_00/eff_b01_000024_00_AnimBP.eff_b01_000024_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000024_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000046_00/eff_b01_000046_00_AnimBP.eff_b01_000046_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000046_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000042_00/eff_b01_000042_00_AnimBP.eff_b01_000042_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000042_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000021_00/eff_b02_000021_00_AnimBP.eff_b02_000021_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000021_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000081_01/eff_b04_000081_01_AnimBP.eff_b04_000081_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000081_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000021_00/eff_b00_000021_00_AnimBP.eff_b00_000021_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000021_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_6/eff_b01_000070_00_6_AnimBP.eff_b01_000070_00_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000024_00/eff_b00_000024_00_AnimBP.eff_b00_000024_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000024_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000010_11/eff_b04_000010_11_AnimBP.eff_b04_000010_11_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000010_11_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_5/eff_b04_000000_50_5_AnimBP.eff_b04_000000_50_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_4/eff_b04_000000_50_4_AnimBP.eff_b04_000000_50_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000080_01/eff_b04_000080_01_AnimBP.eff_b04_000080_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000080_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/w06/_Unique/eff_w06_50_01/eff_w06_50_01_AnimBP.eff_w06_50_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_w06_50_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d17001_02/eff_cmn_d17001_02_AnimBP.eff_cmn_d17001_02_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d17001_02_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_5/eff_b01_000070_00_5_AnimBP.eff_b01_000070_00_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000022_00/eff_b02_000022_00_AnimBP.eff_b02_000022_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000022_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_2/eff_b04_000000_50_2_AnimBP.eff_b04_000000_50_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000050_04/eff_b03_000050_04_AnimBP.eff_b03_000050_04_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000050_04_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000083_01/eff_b04_000083_01_AnimBP.eff_b04_000083_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000083_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_0000f6_00/eff_cmn_0000f6_00_AnimBP.eff_cmn_0000f6_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_0000f6_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_0000f6_01/eff_cmn_0000f6_01_AnimBP.eff_cmn_0000f6_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_0000f6_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000040_04/eff_b03_000040_04_AnimBP.eff_b03_000040_04_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000040_04_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000084_01/eff_b04_000084_01_AnimBP.eff_b04_000084_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000084_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000086_01/eff_b04_000086_01_AnimBP.eff_b04_000086_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000086_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Itm/Eff/eff_itm_000000_00/_Unique/eff_itm_000000_00/eff_itm_000000_00_AnimBP.eff_itm_000000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_itm_000000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000000_50_6/eff_b04_000000_50_6_AnimBP.eff_b04_000000_50_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000000_50_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_5/eff_b03_000001_00_5_AnimBP.eff_b03_000001_00_5_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_5_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_1/eff_b01_000070_00_1_AnimBP.eff_b01_000070_00_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/c04/_Unique/eff_c04_50_00/eff_c04_50_00_AnimBP.eff_c04_50_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_c04_50_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000013_00/eff_b01_000013_00_AnimBP.eff_b01_000013_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000013_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_2/eff_b03_000001_00_2_AnimBP.eff_b03_000001_00_2_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_2_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000041_00/eff_b01_000041_00_AnimBP.eff_b01_000041_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000041_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000026_00/eff_b00_000026_00_AnimBP.eff_b00_000026_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000026_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000020_00/eff_b02_000020_00_AnimBP.eff_b02_000020_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000020_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000050_10/eff_b04_000050_10_AnimBP.eff_b04_000050_10_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000050_10_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00_3/eff_b01_000070_00_3_AnimBP.eff_b01_000070_00_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000020_04_1/eff_b04_000020_04_1_AnimBP.eff_b04_000020_04_1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000020_04_1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000010_00/eff_b01_000010_00_AnimBP.eff_b01_000010_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000010_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000070_00/eff_b01_000070_00_AnimBP.eff_b01_000070_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000070_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000040_00/eff_b01_000040_00_AnimBP.eff_b01_000040_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000040_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000024_00/eff_b02_000024_00_AnimBP.eff_b02_000024_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000024_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_6/eff_b03_000001_00_6_AnimBP.eff_b03_000001_00_6_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_6_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/c03/_Unique/eff_c03_51_00/_sub/eff_c03_51_00_sub1/eff_c03_51_00_sub1_AnimBP.eff_c03_51_00_sub1_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_c03_51_00_sub1_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000015_00/eff_b01_000015_00_AnimBP.eff_b01_000015_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000015_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000021_00/eff_b01_000021_00_AnimBP.eff_b01_000021_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000021_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b04/_Unique/eff_b04_000090_01/eff_b04_000090_01_AnimBP.eff_b04_000090_01_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b04_000090_01_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b00/_Unique/eff_b00_000023_00/eff_b00_000023_00_AnimBP.eff_b00_000023_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b00_000023_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000014_00/eff_b01_000014_00_AnimBP.eff_b01_000014_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000014_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/c03/_Unique/eff_c03_51_00/eff_c03_51_00_AnimBP.eff_c03_51_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_c03_51_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000020_00/eff_b01_000020_00_AnimBP.eff_b01_000020_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000020_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000023_00/eff_b02_000023_00_AnimBP.eff_b02_000023_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000023_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000008_03/eff_b02_000008_03_AnimBP.eff_b02_000008_03_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000008_03_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b02/_Unique/eff_b02_000025_00/eff_b02_000025_00_AnimBP.eff_b02_000025_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b02_000025_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_3/eff_b03_000001_00_3_AnimBP.eff_b03_000001_00_3_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_3_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b03/_Unique/eff_b03_000001_00_4/eff_b03_000001_00_4_AnimBP.eff_b03_000001_00_4_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b03_000001_00_4_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_d10000_00/eff_cmn_d10000_00_AnimBP.eff_cmn_d10000_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_cmn_d10000_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Effect/Life/b01/_Unique/eff_b01_000025_00/eff_b01_000025_00_AnimBP.eff_b01_000025_00_AnimBP_C
/// Size: 0x0798 (1944 bytes) (0x000798 - 0x000798) align 16 MaxSize: 0x0798
class Ueff_b01_000025_00_AnimBP_C : public UEffect_Stand_AnimBP_C
{ 
public:
};

/// Class /Game/Graphics/3D/Object/obj070002/00/Effect/BP_eff_obj070002_00_01.BP_eff_obj070002_00_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_obj070002_00_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_obj070002_00_01;                                        // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_0b.BP_eff_cmn_100000_0b_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_0b_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_00.BP_eff_b02_000005_00_C
/// Size: 0x0428 (1064 bytes) (0x000411 - 0x000428) align 8 MaxSize: 0x0428
class ABP_eff_b02_000005_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_00.BP_eff_b02_000005_00_C.EffectAnimLoopOut
	// void EffectAnimLoopOut();                                                                                                // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_00.BP_eff_b02_000005_00_C.ParStart
	// void ParStart();                                                                                                         // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_00.BP_eff_b02_000005_00_C.ExecuteUbergraph_BP_eff_b02_000005_00
	// void ExecuteUbergraph_BP_eff_b02_000005_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_01.BP_eff_b02_000007_01_C
/// Size: 0x0428 (1064 bytes) (0x000411 - 0x000428) align 8 MaxSize: 0x0428
class ABP_eff_b02_000007_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_01.BP_eff_b02_000007_01_C.EffectAnimLoopOut
	// void EffectAnimLoopOut();                                                                                                // [0x2fd44f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_01.BP_eff_b02_000007_01_C.ParStart
	// void ParStart();                                                                                                         // [0x2fd44f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_01.BP_eff_b02_000007_01_C.ExecuteUbergraph_BP_eff_b02_000007_01
	// void ExecuteUbergraph_BP_eff_b02_000007_01(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000002.BP_eff_itm_000002_21_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000002_21_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000002;                                             // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Event/ev90_00300/BP_eff_ev9000300102.BP_eff_ev9000300102_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_ev9000300102_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000010_00.BP_eff_cmn_000010_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000010_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_05.BP_eff_cmn_100000_05_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_05_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000f_01.BP_eff_cmn_00000f_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000f_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_03.BP_eff_c04_90_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_03;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00004a_00.BP_eff_cmn_00004a_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00004a_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_0e.BP_eff_cmn_100000_0e_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_0e_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000043_00.BP_eff_cmn_000043_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000043_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000043_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_04_01.BP_eff_c02_04_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_04_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_05_01.BP_eff_c02_05_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_05_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_01_02.BP_eff_c04_01_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_01_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_02;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_06_02.BP_eff_c04_06_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_06_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_06_02;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_05_02.BP_eff_c04_05_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_05_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_04_00.BP_eff_c02_04_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_04_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_04_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_05_00.BP_eff_c02_05_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_05_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000011_00.BP_eff_cmn_000011_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000011_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_0000f1_00.BP_eff_cmn_0000f1_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_0000f1_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_04.BP_eff_cmn_100000_04_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_04_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090_03.BP_eff_cmn_000090_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000090_03;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000091_03.BP_eff_cmn_000091_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000091_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000091_03;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_00_00.BP_eff_c03_00_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_00_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_60_00.BP_eff_c03_60_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_60_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_21_00.BP_eff_c02_21_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_21_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090.BP_eff_cmn_000090_13_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_13_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_62_00.BP_eff_c03_62_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_62_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_02_01.BP_eff_c03_02_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_02_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_02_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900012_00.BP_eff_cmn_900012_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900012_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900012_00.BP_eff_cmn_900012_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900012_00.BP_eff_cmn_900012_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900012_00.BP_eff_cmn_900012_00_C.ExecuteUbergraph_BP_eff_cmn_900012_00
	// void ExecuteUbergraph_BP_eff_cmn_900012_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_01_00.BP_eff_c03_01_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_01_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_03_00.BP_eff_c03_03_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_03_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_03_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_11_00.BP_eff_c03_11_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_11_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_11_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_13_00.BP_eff_c03_13_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_13_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_13_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900010_00.BP_eff_cmn_900010_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900010_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900010_00.BP_eff_cmn_900010_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900010_00.BP_eff_cmn_900010_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900010_00.BP_eff_cmn_900010_00_C.ExecuteUbergraph_BP_eff_cmn_900010_00
	// void ExecuteUbergraph_BP_eff_cmn_900010_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900011_00.BP_eff_cmn_900011_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900011_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900011_00.BP_eff_cmn_900011_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900011_00.BP_eff_cmn_900011_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900011_00.BP_eff_cmn_900011_00_C.ExecuteUbergraph_BP_eff_cmn_900011_00
	// void ExecuteUbergraph_BP_eff_cmn_900011_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_02_00.BP_eff_c03_02_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_02_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_02_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_06_01.BP_eff_c03_06_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_06_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_06_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_61_00.BP_eff_c03_61_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_61_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_63_00.BP_eff_c03_63_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_63_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_72_00.BP_eff_c03_72_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_72_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_12_00.BP_eff_c03_12_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_12_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_12_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_12_01.BP_eff_c03_12_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_12_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_12_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_66_01.BP_eff_c03_66_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_66_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_71_00.BP_eff_c03_71_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_71_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_73_00.BP_eff_c03_73_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_73_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_62_01.BP_eff_c03_62_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_62_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_72_01.BP_eff_c03_72_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_72_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00004a.BP_eff_cmn_00004a_30_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00004a_30_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_06_00.BP_eff_c03_06_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_06_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_06_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_01.BP_eff_cmn_100000_01_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_100000_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_01.BP_eff_cmn_100000_01_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_01.BP_eff_cmn_100000_01_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_01.BP_eff_cmn_100000_01_C.ExecuteUbergraph_BP_eff_cmn_100000_01
	// void ExecuteUbergraph_BP_eff_cmn_100000_01(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_02.BP_eff_b02_000007_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b02_000007_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_00.BP_eff_b02_000007_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b02_000007_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000002_00.BP_eff_cmn_000002_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000002_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_a00000_00.BP_eff_cmn_a00000_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_a00000_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_06.BP_eff_cmn_100000_06_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_06_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_06.BP_eff_c04_90_06_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_06_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_06;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_01.BP_eff_b02_000005_01_5_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b02_000005_01_5_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000002.BP_eff_itm_000002_20_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000002_20_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000002;                                             // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000003_05.BP_eff_itm_000003_05_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000003_05_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000003_05;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000015_00.BP_eff_cmn_000015_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000015_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000d_01.BP_eff_cmn_00000d_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000d_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000e_01.BP_eff_cmn_00000e_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000e_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000001_00.BP_eff_itm_000001_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000001_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000001_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000b_00.BP_eff_cmn_00000b_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000b_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara_01;                                                 // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000b_01.BP_eff_cmn_00000b_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000b_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara_01;                                                 // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Event/ev90_00300/BP_eff_ev9000300101.BP_eff_ev9000300101_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_ev9000300101_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b00/BP_eff_b00_000005_01.BP_eff_b00_000005_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b00_000005_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_21_00.BP_eff_c03_21_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_21_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_21_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_05_01.BP_eff_c03_05_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_05_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_05_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_81_00.BP_eff_c03_81_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_81_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_04_01.BP_eff_c03_04_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_04_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_04_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_00.BP_eff_c04_90_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000f_00.BP_eff_cmn_00000f_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000f_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000c_00.BP_eff_cmn_00000c_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000c_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_04_02.BP_eff_c02_04_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_04_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_0000f2_00.BP_eff_cmn_0000f2_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_0000f2_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000a_00.BP_eff_cmn_00000a_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000a_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara01;                                                  // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000047_00.BP_eff_cmn_000047_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000047_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000046_00.BP_eff_cmn_000046_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000046_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_05_02.BP_eff_c02_05_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_05_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000e_00.BP_eff_cmn_00000e_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000e_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_00_00.BP_eff_c02_00_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_00_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_07.BP_eff_c04_90_07_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_07_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_07;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00000d_00.BP_eff_cmn_00000d_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00000d_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Weapon/wpn1004/wpn100404/01/Effect/BP_eff_wpn100404.BP_eff_wpn100404_20_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_wpn100404_20_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_00_01.BP_eff_c02_00_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_00_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00;                                                 // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_03_00.BP_eff_c04_03_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_03_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_04_02.BP_eff_c03_04_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_04_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_04_02;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_05_02.BP_eff_c03_05_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_05_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_05_02;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_01_00.BP_eff_c04_01_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_01_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_03_01.BP_eff_c04_03_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_03_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000003_01.BP_eff_itm_000003_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000003_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000003_01;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000002.BP_eff_itm_000002_40_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000002_40_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000002;                                             // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000002.BP_eff_itm_000002_41_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000002_41_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000002;                                             // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_01_00.BP_eff_c02_01_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_01_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_01_01.BP_eff_c02_01_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_01_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_01;                                                 // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_05_00.BP_eff_c03_05_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_05_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_05_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_04_01.BP_eff_c04_04_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_04_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_04_02.BP_eff_c04_04_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_04_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000003_04.BP_eff_itm_000003_04_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000003_04_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000003_04;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_00_00.BP_eff_c04_00_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_00_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_05_01.BP_eff_c04_05_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_05_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000000_01.BP_eff_cmn_000000_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000000_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000000_00.BP_eff_cmn_000000_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000000_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_01.BP_eff_c04_90_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_0c.BP_eff_cmn_100000_0c_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_0c_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000042_00.BP_eff_cmn_000042_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000042_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000042_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00004a.BP_eff_cmn_00004a_10_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00004a_10_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000045_00.BP_eff_cmn_000045_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000045_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00004a.BP_eff_cmn_00004a_40_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00004a_40_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_00004a.BP_eff_cmn_00004a_20_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_00004a_20_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000045_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_30_00.BP_eff_c03_30_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_30_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_30_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_03_01.BP_eff_c01_03_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_03_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_04_02.BP_eff_c01_04_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_04_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_22_00.BP_eff_c03_22_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_22_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_22_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_06_01.BP_eff_c01_06_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_06_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_06_01.BP_eff_c02_06_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_06_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_23_01.BP_eff_c02_23_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_23_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000001_00.BP_eff_cmn_000001_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000001_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_05_02.BP_eff_c01_05_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_05_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100_00.BP_eff_cmn_000100_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000100_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000100_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_0f.BP_eff_cmn_100000_0f_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_0f_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Weapon/wpn1004/wpn100404/01/Effect/BP_eff_wpn100404.BP_eff_wpn100404_10_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_wpn100404_10_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000007_03.BP_eff_b02_000007_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b02_000007_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_10_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000100_10_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000100;                                             // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_11_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_000100_11_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_11_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_11_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000100.BP_eff_cmn_000100_11_C.ExecuteUbergraph_BP_eff_cmn_000100
	// void ExecuteUbergraph_BP_eff_cmn_000100(int32_t EntryPoint);                                                             // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_08.BP_eff_cmn_100000_08_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_08_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_04_00.BP_eff_c04_04_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_04_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000.BP_eff_cmn_100000_10_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_10_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_02.BP_eff_cmn_100000_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_20_00.BP_eff_c03_20_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_20_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_20_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_00.BP_eff_cmn_100000_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_100000_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_00.BP_eff_cmn_100000_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_00.BP_eff_cmn_100000_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_00.BP_eff_cmn_100000_00_C.ExecuteUbergraph_BP_eff_cmn_100000_00
	// void ExecuteUbergraph_BP_eff_cmn_100000_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_100000_0a.BP_eff_cmn_100000_0a_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_100000_0a_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_00.BP_eff_cmn_900000_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900000_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_00.BP_eff_cmn_900000_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_00.BP_eff_cmn_900000_00_C.ExecuteUbergraph_BP_eff_cmn_900000_00
	// void ExecuteUbergraph_BP_eff_cmn_900000_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_01.BP_eff_cmn_900000_01_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900000_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_01.BP_eff_cmn_900000_01_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_01.BP_eff_cmn_900000_01_C.ExecuteUbergraph_BP_eff_cmn_900000_01
	// void ExecuteUbergraph_BP_eff_cmn_900000_01(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900020_00.BP_eff_cmn_900020_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900020_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900020_00.BP_eff_cmn_900020_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900020_00.BP_eff_cmn_900020_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900020_00.BP_eff_cmn_900020_00_C.ExecuteUbergraph_BP_eff_cmn_900020_00
	// void ExecuteUbergraph_BP_eff_cmn_900020_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_02.BP_eff_cmn_900000_02_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900000_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_02.BP_eff_cmn_900000_02_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900000_02.BP_eff_cmn_900000_02_C.ExecuteUbergraph_BP_eff_cmn_900000_02
	// void ExecuteUbergraph_BP_eff_cmn_900000_02(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900021_00.BP_eff_cmn_900021_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900021_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900021_00.BP_eff_cmn_900021_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900021_00.BP_eff_cmn_900021_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900021_00.BP_eff_cmn_900021_00_C.ExecuteUbergraph_BP_eff_cmn_900021_00
	// void ExecuteUbergraph_BP_eff_cmn_900021_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900022_00.BP_eff_cmn_900022_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_900022_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900022_00.BP_eff_cmn_900022_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900022_00.BP_eff_cmn_900022_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_900022_00.BP_eff_cmn_900022_00_C.ExecuteUbergraph_BP_eff_cmn_900022_00
	// void ExecuteUbergraph_BP_eff_cmn_900022_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090_00.BP_eff_cmn_000090_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000091_00.BP_eff_cmn_000091_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000091_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000091_00;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000091_01.BP_eff_cmn_000091_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000091_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_cmn_000091_01;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_0000a0_00.BP_eff_cmn_0000a0_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_0000a0_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     Niagara_00;                                                 // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_05.BP_eff_c04_90_05_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_05_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_05;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090_01.BP_eff_cmn_000090_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090_02.BP_eff_cmn_000090_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000090_50/BP_eff_cmn_000090.BP_eff_cmn_000090_50_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_50_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/_Unique/eff_cmn_000090_51/BP_eff_cmn_000090.BP_eff_cmn_000090_51_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_51_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000090.BP_eff_cmn_000090_10_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000090_10_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_04_03.BP_eff_c01_04_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_04_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_05_03.BP_eff_c01_05_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_05_03_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_05_01.BP_eff_c01_05_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_05_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_01_01.BP_eff_c04_01_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_01_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_01.BP_eff_cmn_000101_01_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_000101_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_01.BP_eff_cmn_000101_01_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_01.BP_eff_cmn_000101_01_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_01.BP_eff_cmn_000101_01_C.ExecuteUbergraph_BP_eff_cmn_000101_01
	// void ExecuteUbergraph_BP_eff_cmn_000101_01(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_00.BP_eff_cmn_000101_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_000101_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_00.BP_eff_cmn_000101_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_00.BP_eff_cmn_000101_00_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2fd44f0] Event|Public|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000101_00.BP_eff_cmn_000101_00_C.ExecuteUbergraph_BP_eff_cmn_000101_00
	// void ExecuteUbergraph_BP_eff_cmn_000101_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_06_00.BP_eff_c01_06_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_06_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_05_00.BP_eff_c04_05_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_05_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_01_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_23_00.BP_eff_c02_23_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_23_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c02/BP_eff_c02_06_00.BP_eff_c02_06_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c02_06_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c02_00_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_06_01.BP_eff_c04_06_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_06_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_06_01;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/b02/BP_eff_b02_000005_01.BP_eff_b02_000005_01_6_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_b02_000005_01_6_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000012_00.BP_eff_cmn_000012_00_C
/// Size: 0x0430 (1072 bytes) (0x000411 - 0x000430) align 8 MaxSize: 0x0430
class ABP_eff_cmn_000012_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	class UNiagaraComponent*                           Niagara;                                                    // 0x0420   (0x0008)  
	double                                             DestroyTime;                                                // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000012_00.BP_eff_cmn_000012_00_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2fd44f0] Event|Protected|BlueprintEvent 
	// Function /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000012_00.BP_eff_cmn_000012_00_C.ExecuteUbergraph_BP_eff_cmn_000012_00
	// void ExecuteUbergraph_BP_eff_cmn_000012_00(int32_t EntryPoint);                                                          // [0x2fd44f0] Final                
};

/// Class /Game/Graphics/3D/Effect/Life/c03/BP_eff_c03_04_00.BP_eff_c03_04_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c03_04_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c03_04_00;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_90_02.BP_eff_c04_90_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c04_90_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_c04_90_02;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Itm/BP_eff_itm_000003_02.BP_eff_itm_000003_02_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_itm_000003_02_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     eff_itm_000003_02;                                          // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c01/BP_eff_c01_04_01.BP_eff_c01_04_01_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_c01_04_01_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UNiagaraComponent*                           Niagara;                                                    // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Cmn/BP_eff_cmn_000030_00.BP_eff_cmn_000030_00_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
class ABP_eff_cmn_000030_00_C : public ABP_EffectBase_Par_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0411   (0x0007)  MISSED
	class UEffectNiagaraComponent*                     EffectNiagara;                                              // 0x0418   (0x0008)  
};

/// Class /Game/Graphics/3D/Effect/Life/c04/BP_eff_c04_05_03.BP_eff_c04_05_03_C
/// Size: 0x0420 (1056 bytes) (0x000411 - 0x000420) align 8 MaxSize: 0x0420
